lightelf76/FNET/fnet_stack/port/cpu/lm3s/lm3s_bits.h
#define SYSCTL_DC0_SRAMSZ_M            0xFFFF0000  // SRAM Size
#define SYSCTL_DC0_SRAMSZ_2KB          0x00070000  // 2 KB of SRAM
#define SYSCTL_DC0_SRAMSZ_4KB          0x000F0000  // 4 KB of SRAM
#define SYSCTL_DC0_SRAMSZ_6KB          0x00170000  // 6 KB of SRAM
#define SYSCTL_DC0_SRAMSZ_8KB          0x001F0000  // 8 KB of SRAM
#define SYSCTL_DC0_SRAMSZ_12KB         0x002F0000  // 12 KB of SRAM
#define SYSCTL_DC0_SRAMSZ_16KB         0x003F0000  // 16 KB of SRAM
#define SYSCTL_DC0_SRAMSZ_20KB         0x004F0000  // 20 KB of SRAM
#define SYSCTL_DC0_SRAMSZ_24KB         0x005F0000  // 24 KB of SRAM
#define SYSCTL_DC0_SRAMSZ_32KB         0x007F0000  // 32 KB of SRAM
#define SYSCTL_DC0_SRAMSZ_48KB         0x00BF0000  // 48 KB of SRAM
#define SYSCTL_DC0_SRAMSZ_64KB         0x00FF0000  // 64 KB of SRAM
#define SYSCTL_DC0_SRAMSZ_96KB         0x017F0000  // 96 KB of SRAM
#define SYSCTL_DC0_FLASHSZ_M           0x0000FFFF  // Flash Size
#define SYSCTL_DC0_FLASHSZ_8KB         0x00000003  // 8 KB of Flash
#define SYSCTL_DC0_FLASHSZ_16KB        0x00000007  // 16 KB of Flash
#define SYSCTL_DC0_FLASHSZ_32KB        0x0000000F  // 32 KB of Flash
#define SYSCTL_DC0_FLASHSZ_64KB        0x0000001F  // 64 KB of Flash
#define SYSCTL_DC0_FLASHSZ_96KB        0x0000002F  // 96 KB of Flash
#define SYSCTL_DC0_FLASHSZ_128K        0x0000003F  // 128 KB of Flash
#define SYSCTL_DC0_FLASHSZ_192K        0x0000005F  // 192 KB of Flash
#define SYSCTL_DC0_FLASHSZ_256K        0x0000007F  // 256 KB of Flash
#define SYSCTL_DC0_FLASHSZ_384K        0x000000BF  // 384 KB of Flash
#define SYSCTL_DC0_FLASHSZ_512K        0x000000FF  // 512 KB of Flash
#define SYSCTL_DC0_SRAMSZ_S            16          // SRAM size shift
#define SYSCTL_DC0_FLASHSZ_S           0           // Flash size shift

#define SYSCTL_DC1_WDT1                0x10000000  // Watchdog Timer1 Present
#define SYSCTL_DC1_CAN2                0x04000000  // CAN Module 2 Present
#define SYSCTL_DC1_CAN1                0x02000000  // CAN Module 1 Present
#define SYSCTL_DC1_CAN0                0x01000000  // CAN Module 0 Present
#define SYSCTL_DC1_PWM1                0x00200000  // PWM Module 1 Present
#define SYSCTL_DC1_PWM0                0x00100000  // PWM Module 0 Present
#define SYSCTL_DC1_ADC1                0x00020000  // ADC Module 1 Present
#define SYSCTL_DC1_ADC0                0x00010000  // ADC Module 0 Present
#define SYSCTL_DC1_MINSYSDIV_M         0x0000F000  // System Clock Divider
#define SYSCTL_DC1_MINSYSDIV_100       0x00001000  // Divide VCO (400MHZ) by 5 minimum
#define SYSCTL_DC1_MINSYSDIV_66        0x00002000  // Divide VCO (400MHZ) by 2*2 + 2 = 6 minimum
#define SYSCTL_DC1_MINSYSDIV_50        0x00003000  // Specifies a 50-MHz CPU clock with a PLL divider of 4
#define SYSCTL_DC1_MINSYSDIV_40        0x00004000  // Specifies a 40-MHz CPU clock with a PLL divider of 5
#define SYSCTL_DC1_MINSYSDIV_25        0x00007000  // Specifies a 25-MHz clock with a PLL divider of 8
#define SYSCTL_DC1_MINSYSDIV_20        0x00009000  // Specifies a 20-MHz clock with a PLL divider of 10
#define SYSCTL_DC1_ADC1SPD_M           0x00000C00  // Max ADC1 Speed
#define SYSCTL_DC1_ADC1SPD_125K        0x00000000  // 125K samples/second
#define SYSCTL_DC1_ADC1SPD_250K        0x00000400  // 250K samples/second
#define SYSCTL_DC1_ADC1SPD_500K        0x00000800  // 500K samples/second
#define SYSCTL_DC1_ADC1SPD_1M          0x00000C00  // 1M samples/second
#define SYSCTL_DC1_ADC0SPD_M           0x00000300  // Max ADC0 Speed
#define SYSCTL_DC1_ADC0SPD_125K        0x00000000  // 125K samples/second
#define SYSCTL_DC1_ADC0SPD_250K        0x00000100  // 250K samples/second
#define SYSCTL_DC1_ADC0SPD_500K        0x00000200  // 500K samples/second
#define SYSCTL_DC1_ADC0SPD_1M          0x00000300  // 1M samples/second
#define SYSCTL_DC1_MPU                 0x00000080  // MPU Present
#define SYSCTL_DC1_HIB                 0x00000040  // Hibernation Module Present
#define SYSCTL_DC1_TEMP                0x00000020  // Temp Sensor Present
#define SYSCTL_DC1_PLL                 0x00000010  // PLL Present
#define SYSCTL_DC1_WDT0                0x00000008  // Watchdog Timer 0 Present
#define SYSCTL_DC1_SWO                 0x00000004  // SWO Trace Port Present
#define SYSCTL_DC1_SWD                 0x00000002  // SWD Present
#define SYSCTL_DC1_JTAG                0x00000001  // JTAG Present

#define SYSCTL_DC2_EPI0                0x40000000  // EPI Module 0 Present
#define SYSCTL_DC2_I2S0                0x10000000  // I2S Module 0 Present
#define SYSCTL_DC2_COMP2               0x04000000  // Analog Comparator 2 Present
#define SYSCTL_DC2_COMP1               0x02000000  // Analog Comparator 1 Present
#define SYSCTL_DC2_COMP0               0x01000000  // Analog Comparator 0 Present
#define SYSCTL_DC2_TIMER3              0x00080000  // Timer Module 3 Present
#define SYSCTL_DC2_TIMER2              0x00040000  // Timer Module 2 Present
#define SYSCTL_DC2_TIMER1              0x00020000  // Timer Module 1 Present
#define SYSCTL_DC2_TIMER0              0x00010000  // Timer Module 0 Present
#define SYSCTL_DC2_I2C1HS              0x00008000  // I2C Module 1 Speed
#define SYSCTL_DC2_I2C1                0x00004000  // I2C Module 1 Present
#define SYSCTL_DC2_I2C0HS              0x00002000  // I2C Module 0 Speed
#define SYSCTL_DC2_I2C0                0x00001000  // I2C Module 0 Present
#define SYSCTL_DC2_QEI1                0x00000200  // QEI Module 1 Present
#define SYSCTL_DC2_QEI0                0x00000100  // QEI Module 0 Present
#define SYSCTL_DC2_SSI1                0x00000020  // SSI Module 1 Present
#define SYSCTL_DC2_SSI0                0x00000010  // SSI Module 0 Present
#define SYSCTL_DC2_UART2               0x00000004  // UART Module 2 Present
#define SYSCTL_DC2_UART1               0x00000002  // UART Module 1 Present
#define SYSCTL_DC2_UART0               0x00000001  // UART Module 0 Present

#define SYSCTL_DC3_32KHZ               0x80000000  // 32KHz Input Clock Available
#define SYSCTL_DC3_CCP5                0x20000000  // CCP5 Pin Present
#define SYSCTL_DC3_CCP4                0x10000000  // CCP4 Pin Present
#define SYSCTL_DC3_CCP3                0x08000000  // CCP3 Pin Present
#define SYSCTL_DC3_CCP2                0x04000000  // CCP2 Pin Present
#define SYSCTL_DC3_CCP1                0x02000000  // CCP1 Pin Present
#define SYSCTL_DC3_CCP0                0x01000000  // CCP0 Pin Present
#define SYSCTL_DC3_ADC0AIN7            0x00800000  // ADC Module 0 AIN7 Pin Present
#define SYSCTL_DC3_ADC0AIN6            0x00400000  // ADC Module 0 AIN6 Pin Present
#define SYSCTL_DC3_ADC0AIN5            0x00200000  // ADC Module 0 AIN5 Pin Present
#define SYSCTL_DC3_ADC0AIN4            0x00100000  // ADC Module 0 AIN4 Pin Present
#define SYSCTL_DC3_ADC0AIN3            0x00080000  // ADC Module 0 AIN3 Pin Present
#define SYSCTL_DC3_ADC0AIN2            0x00040000  // ADC Module 0 AIN2 Pin Present
#define SYSCTL_DC3_ADC0AIN1            0x00020000  // ADC Module 0 AIN1 Pin Present
#define SYSCTL_DC3_ADC0AIN0            0x00010000  // ADC Module 0 AIN0 Pin Present
#define SYSCTL_DC3_PWMFAULT            0x00008000  // PWM Fault Pin Present
#define SYSCTL_DC3_C2O                 0x00004000  // C2o Pin Present
#define SYSCTL_DC3_C2PLUS              0x00002000  // C2+ Pin Present
#define SYSCTL_DC3_C2MINUS             0x00001000  // C2- Pin Present
#define SYSCTL_DC3_C1O                 0x00000800  // C1o Pin Present
#define SYSCTL_DC3_C1PLUS              0x00000400  // C1+ Pin Present
#define SYSCTL_DC3_C1MINUS             0x00000200  // C1- Pin Present
#define SYSCTL_DC3_C0O                 0x00000100  // C0o Pin Present
#define SYSCTL_DC3_C0PLUS              0x00000080  // C0+ Pin Present
#define SYSCTL_DC3_C0MINUS             0x00000040  // C0- Pin Present
#define SYSCTL_DC3_PWM5                0x00000020  // PWM5 Pin Present
#define SYSCTL_DC3_PWM4                0x00000010  // PWM4 Pin Present
#define SYSCTL_DC3_PWM3                0x00000008  // PWM3 Pin Present
#define SYSCTL_DC3_PWM2                0x00000004  // PWM2 Pin Present
#define SYSCTL_DC3_PWM1                0x00000002  // PWM1 Pin Present
#define SYSCTL_DC3_PWM0                0x00000001  // PWM0 Pin Present

#define SYSCTL_DC4_ETH                 0x50000000  // Ethernet present
#define SYSCTL_DC4_EPHY0               0x40000000  // Ethernet PHY Layer 0 Present
#define SYSCTL_DC4_EMAC0               0x10000000  // Ethernet MAC Layer 0 Present
#define SYSCTL_DC4_E1588               0x01000000  // 1588 Capable
#define SYSCTL_DC4_PICAL               0x00040000  // PIOSC Calibrate
#define SYSCTL_DC4_CCP7                0x00008000  // CCP7 Pin Present
#define SYSCTL_DC4_CCP6                0x00004000  // CCP6 Pin Present
#define SYSCTL_DC4_UDMA                0x00002000  // Micro-DMA Module Present
#define SYSCTL_DC4_ROM                 0x00001000  // Internal Code ROM Present
#define SYSCTL_DC4_GPIOJ               0x00000100  // GPIO Port J Present
#define SYSCTL_DC4_GPIOH               0x00000080  // GPIO Port H Present
#define SYSCTL_DC4_GPIOG               0x00000040  // GPIO Port G Present
#define SYSCTL_DC4_GPIOF               0x00000020  // GPIO Port F Present
#define SYSCTL_DC4_GPIOE               0x00000010  // GPIO Port E Present
#define SYSCTL_DC4_GPIOD               0x00000008  // GPIO Port D Present
#define SYSCTL_DC4_GPIOC               0x00000004  // GPIO Port C Present
#define SYSCTL_DC4_GPIOB               0x00000002  // GPIO Port B Present
#define SYSCTL_DC4_GPIOA               0x00000001  // GPIO Port A Present

