lightelf76/FNET/fnet_stack/port/cpu/lm3s/lm3s_bits.h
#define SYSCTL_DC5_PWMFAULT3           0x08000000  // PWM Fault 3 Pin Present
#define SYSCTL_DC5_PWMFAULT2           0x04000000  // PWM Fault 2 Pin Present
#define SYSCTL_DC5_PWMFAULT1           0x02000000  // PWM Fault 1 Pin Present
#define SYSCTL_DC5_PWMFAULT0           0x01000000  // PWM Fault 0 Pin Present
#define SYSCTL_DC5_PWMEFLT             0x00200000  // PWM Extended Fault Active
#define SYSCTL_DC5_PWMESYNC            0x00100000  // PWM Extended SYNC Active
#define SYSCTL_DC5_PWM7                0x00000080  // PWM7 Pin Present
#define SYSCTL_DC5_PWM6                0x00000040  // PWM6 Pin Present
#define SYSCTL_DC5_PWM5                0x00000020  // PWM5 Pin Present
#define SYSCTL_DC5_PWM4                0x00000010  // PWM4 Pin Present
#define SYSCTL_DC5_PWM3                0x00000008  // PWM3 Pin Present
#define SYSCTL_DC5_PWM2                0x00000004  // PWM2 Pin Present
#define SYSCTL_DC5_PWM1                0x00000002  // PWM1 Pin Present
#define SYSCTL_DC5_PWM0                0x00000001  // PWM0 Pin Present

#define SYSCTL_DC6_USB0PHY             0x00000010  // USB Module 0 PHY Present
#define SYSCTL_DC6_USB0_M              0x00000003  // USB Module 0 Present
#define SYSCTL_DC6_USB0_DEV            0x00000001  // USB0 is Device Only
#define SYSCTL_DC6_USB0_HOSTDEV        0x00000002  // USB is Device or Host
#define SYSCTL_DC6_USB0_OTG            0x00000003  // USB0 is OTG

#define SYSCTL_DC7_SW                  0x40000000  // Software transfer on uDMA Ch30
#define SYSCTL_DC7_DMACH30             0x40000000  // SW
#define SYSCTL_DC7_DMACH29             0x20000000  // I2S0_TX / CAN1_TX
#define SYSCTL_DC7_DMACH28             0x10000000  // I2S0_RX / CAN1_RX
#define SYSCTL_DC7_DMACH27             0x08000000  // CAN1_TX / ADC1_SS3
#define SYSCTL_DC7_DMACH26             0x04000000  // CAN1_RX / ADC1_SS2
#define SYSCTL_DC7_DMACH25             0x02000000  // SSI1_TX / ADC1_SS1
#define SYSCTL_DC7_SSI1_TX             0x02000000  // SSI1 TX on uDMA Ch25
#define SYSCTL_DC7_SSI1_RX             0x01000000  // SSI1 RX on uDMA Ch24
#define SYSCTL_DC7_DMACH24             0x01000000  // SSI1_RX / ADC1_SS0
#define SYSCTL_DC7_UART1_TX            0x00800000  // UART1 TX on uDMA Ch23
#define SYSCTL_DC7_DMACH23             0x00800000  // UART1_TX / CAN2_TX
#define SYSCTL_DC7_DMACH22             0x00400000  // UART1_RX / CAN2_RX
#define SYSCTL_DC7_UART1_RX            0x00400000  // UART1 RX on uDMA Ch22
#define SYSCTL_DC7_DMACH21             0x00200000  // Timer1B / EPI0_WFIFO
#define SYSCTL_DC7_DMACH20             0x00100000  // Timer1A / EPI0_NBRFIFO
#define SYSCTL_DC7_DMACH19             0x00080000  // Timer0B / Timer1B
#define SYSCTL_DC7_DMACH18             0x00040000  // Timer0A / Timer1A
#define SYSCTL_DC7_DMACH17             0x00020000  // ADC0_SS3
#define SYSCTL_DC7_DMACH16             0x00010000  // ADC0_SS2
#define SYSCTL_DC7_DMACH15             0x00008000  // ADC0_SS1 / Timer2B
#define SYSCTL_DC7_DMACH14             0x00004000  // ADC0_SS0 / Timer2A
#define SYSCTL_DC7_DMACH13             0x00002000  // CAN0_TX / UART2_TX
#define SYSCTL_DC7_DMACH12             0x00001000  // CAN0_RX / UART2_RX
#define SYSCTL_DC7_SSI0_TX             0x00000800  // SSI0 TX on uDMA Ch11
#define SYSCTL_DC7_DMACH11             0x00000800  // SSI0_TX / SSI1_TX
#define SYSCTL_DC7_SSI0_RX             0x00000400  // SSI0 RX on uDMA Ch10
#define SYSCTL_DC7_DMACH10             0x00000400  // SSI0_RX / SSI1_RX
#define SYSCTL_DC7_UART0_TX            0x00000200  // UART0 TX on uDMA Ch9
#define SYSCTL_DC7_DMACH9              0x00000200  // UART0_TX / UART1_TX
#define SYSCTL_DC7_DMACH8              0x00000100  // UART0_RX / UART1_RX
#define SYSCTL_DC7_UART0_RX            0x00000100  // UART0 RX on uDMA Ch8
#define SYSCTL_DC7_DMACH7              0x00000080  // ETH_TX / Timer2B
#define SYSCTL_DC7_DMACH6              0x00000040  // ETH_RX / Timer2A
#define SYSCTL_DC7_DMACH5              0x00000020  // USB_EP3_TX / Timer2B
#define SYSCTL_DC7_USB_EP3_TX          0x00000020  // USB EP3 TX on uDMA Ch5
#define SYSCTL_DC7_USB_EP3_RX          0x00000010  // USB EP3 RX on uDMA Ch4
#define SYSCTL_DC7_DMACH4              0x00000010  // USB_EP3_RX / Timer2A
#define SYSCTL_DC7_USB_EP2_TX          0x00000008  // USB EP2 TX on uDMA Ch3
#define SYSCTL_DC7_DMACH3              0x00000008  // USB_EP2_TX / Timer3B
#define SYSCTL_DC7_USB_EP2_RX          0x00000004  // USB EP2 RX on uDMA Ch2
#define SYSCTL_DC7_DMACH2              0x00000004  // USB_EP2_RX / Timer3A
#define SYSCTL_DC7_USB_EP1_TX          0x00000002  // USB EP1 TX on uDMA Ch1
#define SYSCTL_DC7_DMACH1              0x00000002  // USB_EP1_TX / UART2_TX
#define SYSCTL_DC7_DMACH0              0x00000001  // USB_EP1_RX / UART2_RX
#define SYSCTL_DC7_USB_EP1_RX          0x00000001  // USB EP1 RX on uDMA Ch0

#define SYSCTL_DC8_ADC1AIN15           0x80000000  // ADC Module 1 AIN15 Pin Present
#define SYSCTL_DC8_ADC1AIN14           0x40000000  // ADC Module 1 AIN14 Pin Present
#define SYSCTL_DC8_ADC1AIN13           0x20000000  // ADC Module 1 AIN13 Pin Present
#define SYSCTL_DC8_ADC1AIN12           0x10000000  // ADC Module 1 AIN12 Pin Present
#define SYSCTL_DC8_ADC1AIN11           0x08000000  // ADC Module 1 AIN11 Pin Present
#define SYSCTL_DC8_ADC1AIN10           0x04000000  // ADC Module 1 AIN10 Pin Present
#define SYSCTL_DC8_ADC1AIN9            0x02000000  // ADC Module 1 AIN9 Pin Present
#define SYSCTL_DC8_ADC1AIN8            0x01000000  // ADC Module 1 AIN8 Pin Present
#define SYSCTL_DC8_ADC1AIN7            0x00800000  // ADC Module 1 AIN7 Pin Present
#define SYSCTL_DC8_ADC1AIN6            0x00400000  // ADC Module 1 AIN6 Pin Present
#define SYSCTL_DC8_ADC1AIN5            0x00200000  // ADC Module 1 AIN5 Pin Present
#define SYSCTL_DC8_ADC1AIN4            0x00100000  // ADC Module 1 AIN4 Pin Present
#define SYSCTL_DC8_ADC1AIN3            0x00080000  // ADC Module 1 AIN3 Pin Present
#define SYSCTL_DC8_ADC1AIN2            0x00040000  // ADC Module 1 AIN2 Pin Present
#define SYSCTL_DC8_ADC1AIN1            0x00020000  // ADC Module 1 AIN1 Pin Present
#define SYSCTL_DC8_ADC1AIN0            0x00010000  // ADC Module 1 AIN0 Pin Present
#define SYSCTL_DC8_ADC0AIN15           0x00008000  // ADC Module 0 AIN15 Pin Present
#define SYSCTL_DC8_ADC0AIN14           0x00004000  // ADC Module 0 AIN14 Pin Present
#define SYSCTL_DC8_ADC0AIN13           0x00002000  // ADC Module 0 AIN13 Pin Present
#define SYSCTL_DC8_ADC0AIN12           0x00001000  // ADC Module 0 AIN12 Pin Present
#define SYSCTL_DC8_ADC0AIN11           0x00000800  // ADC Module 0 AIN11 Pin Present
#define SYSCTL_DC8_ADC0AIN10           0x00000400  // ADC Module 0 AIN10 Pin Present
#define SYSCTL_DC8_ADC0AIN9            0x00000200  // ADC Module 0 AIN9 Pin Present
#define SYSCTL_DC8_ADC0AIN8            0x00000100  // ADC Module 0 AIN8 Pin Present
#define SYSCTL_DC8_ADC0AIN7            0x00000080  // ADC Module 0 AIN7 Pin Present
#define SYSCTL_DC8_ADC0AIN6            0x00000040  // ADC Module 0 AIN6 Pin Present
#define SYSCTL_DC8_ADC0AIN5            0x00000020  // ADC Module 0 AIN5 Pin Present
#define SYSCTL_DC8_ADC0AIN4            0x00000010  // ADC Module 0 AIN4 Pin Present
#define SYSCTL_DC8_ADC0AIN3            0x00000008  // ADC Module 0 AIN3 Pin Present
#define SYSCTL_DC8_ADC0AIN2            0x00000004  // ADC Module 0 AIN2 Pin Present
#define SYSCTL_DC8_ADC0AIN1            0x00000002  // ADC Module 0 AIN1 Pin Present
#define SYSCTL_DC8_ADC0AIN0            0x00000001  // ADC Module 0 AIN0 Pin Present

