lightelf76/FNET/fnet_stack/port/cpu/lm3s/lm3s_bits.h
#define SYSCTL_PBORCTL_BORTIM_M        0x0000FFFC  // BOR Time Delay
#define SYSCTL_PBORCTL_BORIOR          0x00000002  // BOR Interrupt or Reset
#define SYSCTL_PBORCTL_BORWT           0x00000001  // BOR Wait and Check for Noise
#define SYSCTL_PBORCTL_BORTIM_S        2

#define SYSCTL_LDOPCTL_M               0x0000003F  // LDO Output Voltage
#define SYSCTL_LDOPCTL_2_50V           0x00000000  // 2.50
#define SYSCTL_LDOPCTL_2_45V           0x00000001  // 2.45
#define SYSCTL_LDOPCTL_2_40V           0x00000002  // 2.40
#define SYSCTL_LDOPCTL_2_35V           0x00000003  // 2.35
#define SYSCTL_LDOPCTL_2_30V           0x00000004  // 2.30
#define SYSCTL_LDOPCTL_2_25V           0x00000005  // 2.25
#define SYSCTL_LDOPCTL_2_75V           0x0000001B  // 2.75
#define SYSCTL_LDOPCTL_2_70V           0x0000001C  // 2.70
#define SYSCTL_LDOPCTL_2_65V           0x0000001D  // 2.65
#define SYSCTL_LDOPCTL_2_60V           0x0000001E  // 2.60
#define SYSCTL_LDOPCTL_2_55V           0x0000001F  // 2.55

#define SYSCTL_SRCR0_WDT1              0x10000000  // WDT1 Reset Control
#define SYSCTL_SRCR0_CAN2              0x04000000  // CAN2 Reset Control
#define SYSCTL_SRCR0_CAN1              0x02000000  // CAN1 Reset Control
#define SYSCTL_SRCR0_CAN0              0x01000000  // CAN0 Reset Control
#define SYSCTL_SRCR0_PWM0              0x00100000  // PWM Reset Control
#define SYSCTL_SRCR0_ADC1              0x00020000  // ADC1 Reset Control
#define SYSCTL_SRCR0_ADC0              0x00010000  // ADC0 Reset Control
#define SYSCTL_SRCR0_HIB               0x00000040  // HIB Reset Control
#define SYSCTL_SRCR0_WDT0              0x00000008  // WDT0 Reset Control

#define SYSCTL_SRCR1_EPI0              0x40000000  // EPI0 Reset Control
#define SYSCTL_SRCR1_I2S0              0x10000000  // I2S0 Reset Control
#define SYSCTL_SRCR1_COMP2             0x04000000  // Analog Comp 2 Reset Control
#define SYSCTL_SRCR1_COMP1             0x02000000  // Analog Comp 1 Reset Control
#define SYSCTL_SRCR1_COMP0             0x01000000  // Analog Comp 0 Reset Control
#define SYSCTL_SRCR1_TIMER3            0x00080000  // Timer 3 Reset Control
#define SYSCTL_SRCR1_TIMER2            0x00040000  // Timer 2 Reset Control
#define SYSCTL_SRCR1_TIMER1            0x00020000  // Timer 1 Reset Control
#define SYSCTL_SRCR1_TIMER0            0x00010000  // Timer 0 Reset Control
#define SYSCTL_SRCR1_I2C1              0x00004000  // I2C1 Reset Control
#define SYSCTL_SRCR1_I2C0              0x00001000  // I2C0 Reset Control
#define SYSCTL_SRCR1_QEI1              0x00000200  // QEI1 Reset Control
#define SYSCTL_SRCR1_QEI0              0x00000100  // QEI0 Reset Control
#define SYSCTL_SRCR1_SSI1              0x00000020  // SSI1 Reset Control
#define SYSCTL_SRCR1_SSI0              0x00000010  // SSI0 Reset Control
#define SYSCTL_SRCR1_UART2             0x00000004  // UART2 Reset Control
#define SYSCTL_SRCR1_UART1             0x00000002  // UART1 Reset Control
#define SYSCTL_SRCR1_UART0             0x00000001  // UART0 Reset Control

#define SYSCTL_SRCR2_EPHY0             0x40000000  // PHY0 Reset Control
#define SYSCTL_SRCR2_EMAC0             0x10000000  // MAC0 Reset Control
#define SYSCTL_SRCR2_USB0              0x00010000  // USB0 Reset Control
#define SYSCTL_SRCR2_UDMA              0x00002000  // Micro-DMA Reset Control
#define SYSCTL_SRCR2_GPIOJ             0x00000100  // Port J Reset Control
#define SYSCTL_SRCR2_GPIOH             0x00000080  // Port H Reset Control
#define SYSCTL_SRCR2_GPIOG             0x00000040  // Port G Reset Control
#define SYSCTL_SRCR2_GPIOF             0x00000020  // Port F Reset Control
#define SYSCTL_SRCR2_GPIOE             0x00000010  // Port E Reset Control
#define SYSCTL_SRCR2_GPIOD             0x00000008  // Port D Reset Control
#define SYSCTL_SRCR2_GPIOC             0x00000004  // Port C Reset Control
#define SYSCTL_SRCR2_GPIOB             0x00000002  // Port B Reset Control
#define SYSCTL_SRCR2_GPIOA             0x00000001  // Port A Reset Control

#define SYSCTL_RIS_MOSCPUPRIS          0x00000100  // MOSC Power Up Raw Interrupt Status
#define SYSCTL_RIS_USBPLLLRIS          0x00000080  // USB PLL Lock Raw Interrupt Status
#define SYSCTL_RIS_PLLLRIS             0x00000040  // PLL Lock Raw Interrupt Status
#define SYSCTL_RIS_CLRIS               0x00000020  // Current Limit Raw Interrupt Status
#define SYSCTL_RIS_IOFRIS              0x00000010  // Internal Oscillator Fault Raw Interrupt Status
#define SYSCTL_RIS_MOFRIS              0x00000008  // Main Oscillator Fault Raw Interrupt Status
#define SYSCTL_RIS_LDORIS              0x00000004  // LDO Power Unregulated Raw Interrupt Status
#define SYSCTL_RIS_BORRIS              0x00000002  // Brown-Out Reset Raw Interrupt Status
#define SYSCTL_RIS_PLLFRIS             0x00000001  // PLL Fault Raw Interrupt Status

#define SYSCTL_IMC_MOSCPUPIM           0x00000100  // MOSC Power Up Interrupt Mask
#define SYSCTL_IMC_USBPLLLIM           0x00000080  // USB PLL Lock Interrupt Mask
#define SYSCTL_IMC_PLLLIM              0x00000040  // PLL Lock Interrupt Mask
#define SYSCTL_IMC_CLIM                0x00000020  // Current Limit Interrupt Mask
#define SYSCTL_IMC_IOFIM               0x00000010  // Internal Oscillator Fault Interrupt Mask
#define SYSCTL_IMC_MOFIM               0x00000008  // Main Oscillator Fault Interrupt Mask
#define SYSCTL_IMC_LDOIM               0x00000004  // LDO Power Unregulated Interrupt Mask
#define SYSCTL_IMC_BORIM               0x00000002  // Brown-Out Reset Interrupt Mask
#define SYSCTL_IMC_PLLFIM              0x00000001  // PLL Fault Interrupt Mask

#define SYSCTL_MISC_MOSCPUPMIS         0x00000100  // MOSC Power Up Masked Interrupt Status
#define SYSCTL_MISC_USBPLLLMIS         0x00000080  // USB PLL Lock Masked Interrupt Status
#define SYSCTL_MISC_PLLLMIS            0x00000040  // PLL Lock Masked Interrupt Status
#define SYSCTL_MISC_CLMIS              0x00000020  // Current Limit Masked Interrupt Status
#define SYSCTL_MISC_IOFMIS             0x00000010  // Internal Oscillator Fault Masked Interrupt Status
#define SYSCTL_MISC_MOFMIS             0x00000008  // Main Oscillator Fault Masked Interrupt Status
#define SYSCTL_MISC_LDOMIS             0x00000004  // LDO Power Unregulated Masked Interrupt Status
#define SYSCTL_MISC_BORMIS             0x00000002  // BOR Masked Interrupt Status

#define SYSCTL_RESC_MOSCFAIL           0x00010000  // MOSC Failure Reset
#define SYSCTL_RESC_LDO                0x00000020  // LDO Reset
#define SYSCTL_RESC_WDT1               0x00000020  // Watchdog Timer 1 Reset
#define SYSCTL_RESC_SW                 0x00000010  // Software Reset
#define SYSCTL_RESC_WDT0               0x00000008  // Watchdog Timer 0 Reset
#define SYSCTL_RESC_BOR                0x00000004  // Brown-Out Reset
#define SYSCTL_RESC_POR                0x00000002  // Power-On Reset
#define SYSCTL_RESC_EXT                0x00000001  // External Reset

