lightelf76/FNET/fnet_stack/port/cpu/lm3s/lm3s_bits.h
#define SYSCTL_RCC_ACG                 0x08000000  // Auto Clock Gating
#define SYSCTL_RCC_SYSDIV_M            0x07800000  // System Clock Divisor
#define SYSCTL_RCC_SYSDIV_2            0x00800000  // System clock /2
#define SYSCTL_RCC_SYSDIV_3            0x01000000  // System clock /3
#define SYSCTL_RCC_SYSDIV_4            0x01800000  // System clock /4
#define SYSCTL_RCC_SYSDIV_5            0x02000000  // System clock /5
#define SYSCTL_RCC_SYSDIV_6            0x02800000  // System clock /6
#define SYSCTL_RCC_SYSDIV_7            0x03000000  // System clock /7
#define SYSCTL_RCC_SYSDIV_8            0x03800000  // System clock /8
#define SYSCTL_RCC_SYSDIV_9            0x04000000  // System clock /9
#define SYSCTL_RCC_SYSDIV_10           0x04800000  // System clock /10
#define SYSCTL_RCC_SYSDIV_11           0x05000000  // System clock /11
#define SYSCTL_RCC_SYSDIV_12           0x05800000  // System clock /12
#define SYSCTL_RCC_SYSDIV_13           0x06000000  // System clock /13
#define SYSCTL_RCC_SYSDIV_14           0x06800000  // System clock /14
#define SYSCTL_RCC_SYSDIV_15           0x07000000  // System clock /15
#define SYSCTL_RCC_SYSDIV_16           0x07800000  // System clock /16
#define SYSCTL_RCC_USESYSDIV           0x00400000  // Enable System Clock Divider
#define SYSCTL_RCC_USEPWMDIV           0x00100000  // Enable PWM Clock Divisor
#define SYSCTL_RCC_PWMDIV_M            0x000E0000  // PWM Unit Clock Divisor
#define SYSCTL_RCC_PWMDIV_2            0x00000000  // PWM clock /2
#define SYSCTL_RCC_PWMDIV_4            0x00020000  // PWM clock /4
#define SYSCTL_RCC_PWMDIV_8            0x00040000  // PWM clock /8
#define SYSCTL_RCC_PWMDIV_16           0x00060000  // PWM clock /16
#define SYSCTL_RCC_PWMDIV_32           0x00080000  // PWM clock /32
#define SYSCTL_RCC_PWMDIV_64           0x000A0000  // PWM clock /64
#define SYSCTL_RCC_PWRDN               0x00002000  // PLL Power Down
#define SYSCTL_RCC_OEN                 0x00001000  // PLL Output Enable
#define SYSCTL_RCC_BYPASS              0x00000800  // PLL Bypass
#define SYSCTL_RCC_XTAL_M              0x000007C0  // Crystal Value
#define SYSCTL_RCC_XTAL_1MHZ           0x00000000  // 1 MHz
#define SYSCTL_RCC_XTAL_1_84MHZ        0x00000040  // 1.8432 MHz
#define SYSCTL_RCC_XTAL_2MHZ           0x00000080  // 2 MHz
#define SYSCTL_RCC_XTAL_2_45MHZ        0x000000C0  // 2.4576 MHz
#define SYSCTL_RCC_XTAL_3_57MHZ        0x00000100  // 3.579545 MHz
#define SYSCTL_RCC_XTAL_3_68MHZ        0x00000140  // 3.6864 MHz
#define SYSCTL_RCC_XTAL_4MHZ           0x00000180  // 4 MHz
#define SYSCTL_RCC_XTAL_4_09MHZ        0x000001C0  // 4.096 MHz
#define SYSCTL_RCC_XTAL_4_91MHZ        0x00000200  // 4.9152 MHz
#define SYSCTL_RCC_XTAL_5MHZ           0x00000240  // 5 MHz
#define SYSCTL_RCC_XTAL_5_12MHZ        0x00000280  // 5.12 MHz
#define SYSCTL_RCC_XTAL_6MHZ           0x000002C0  // 6 MHz
#define SYSCTL_RCC_XTAL_6_14MHZ        0x00000300  // 6.144 MHz
#define SYSCTL_RCC_XTAL_7_37MHZ        0x00000340  // 7.3728 MHz
#define SYSCTL_RCC_XTAL_8MHZ           0x00000380  // 8 MHz
#define SYSCTL_RCC_XTAL_8_19MHZ        0x000003C0  // 8.192 MHz
#define SYSCTL_RCC_XTAL_10MHZ          0x00000400  // 10 MHz
#define SYSCTL_RCC_XTAL_12MHZ          0x00000440  // 12 MHz
#define SYSCTL_RCC_XTAL_12_2MHZ        0x00000480  // 12.288 MHz
#define SYSCTL_RCC_XTAL_13_5MHZ        0x000004C0  // 13.56 MHz
#define SYSCTL_RCC_XTAL_14_3MHZ        0x00000500  // 14.31818 MHz
#define SYSCTL_RCC_XTAL_16MHZ          0x00000540  // 16 MHz
#define SYSCTL_RCC_XTAL_16_3MHZ        0x00000580  // 16.384 MHz
#define SYSCTL_RCC_XTAL_18MHZ          0x000005C0  // 18.0 MHz
#define SYSCTL_RCC_XTAL_20MHZ          0x00000600  // 20.0 MHz
#define SYSCTL_RCC_XTAL_24MHZ          0x00000640  // 24.0 MHz
#define SYSCTL_RCC_XTAL_25MHZ          0x00000680  // 25.0 MHz
#define SYSCTL_RCC_PLLVER              0x00000400  // PLL Verification
#define SYSCTL_RCC_OSCSRC_M            0x00000030  // Oscillator Source
#define SYSCTL_RCC_OSCSRC_MAIN         0x00000000  // MOSC
#define SYSCTL_RCC_OSCSRC_INT          0x00000010  // IOSC
#define SYSCTL_RCC_OSCSRC_INT4         0x00000020  // IOSC/4
#define SYSCTL_RCC_OSCSRC_30           0x00000030  // 30 kHz
#define SYSCTL_RCC_IOSCVER             0x00000008  // Internal Oscillator Verification Timer
#define SYSCTL_RCC_MOSCVER             0x00000004  // Main Oscillator Verification Timer
#define SYSCTL_RCC_IOSCDIS             0x00000002  // Internal Oscillator Disable
#define SYSCTL_RCC_MOSCDIS             0x00000001  // Main Oscillator Disable
#define SYSCTL_RCC_SYSDIV_S            23
#define SYSCTL_RCC_PWMDIV_S            17          // Shift to the PWMDIV field
#define SYSCTL_RCC_XTAL_S              6           // Shift to the XTAL field
#define SYSCTL_RCC_OSCSRC_S            4           // Shift to the OSCSRC field

#define SYSCTL_PLLCFG_OD_M             0x0000C000  // PLL OD Value
#define SYSCTL_PLLCFG_OD_1             0x00000000  // Divide by 1
#define SYSCTL_PLLCFG_OD_2             0x00004000  // Divide by 2
#define SYSCTL_PLLCFG_OD_4             0x00008000  // Divide by 4
#define SYSCTL_PLLCFG_F_M              0x00003FE0  // PLL F Value
#define SYSCTL_PLLCFG_R_M              0x0000001F  // PLL R Value
#define SYSCTL_PLLCFG_F_S              5
#define SYSCTL_PLLCFG_R_S              0

#define SYSCTL_GPIOHBCTL_PORTJ         0x00000100  // Port J Advanced High-Performance Bus
#define SYSCTL_GPIOHBCTL_PORTH         0x00000080  // Port H Advanced High-Performance Bus
#define SYSCTL_GPIOHBCTL_PORTG         0x00000040  // Port G Advanced High-Performance Bus
#define SYSCTL_GPIOHBCTL_PORTF         0x00000020  // Port F Advanced High-Performance Bus
#define SYSCTL_GPIOHBCTL_PORTE         0x00000010  // Port E Advanced High-Performance Bus
#define SYSCTL_GPIOHBCTL_PORTD         0x00000008  // Port D Advanced High-Performance Bus
#define SYSCTL_GPIOHBCTL_PORTC         0x00000004  // Port C Advanced High-Performance Bus
#define SYSCTL_GPIOHBCTL_PORTB         0x00000002  // Port B Advanced High-Performance Bus
#define SYSCTL_GPIOHBCTL_PORTA         0x00000001  // Port A Advanced High-Performance Bus

#define SYSCTL_RCC2_USERCC2            0x80000000  // Use RCC2
#define SYSCTL_RCC2_DIV400             0x40000000  // Divide PLL as 400 MHz vs. 200 MHz
#define SYSCTL_RCC2_SYSDIV2_M          0x1F800000  // System Clock Divisor 2
#define SYSCTL_RCC2_SYSDIV2_2          0x00800000  // System clock /2
#define SYSCTL_RCC2_SYSDIV2_3          0x01000000  // System clock /3
#define SYSCTL_RCC2_SYSDIV2_4          0x01800000  // System clock /4
#define SYSCTL_RCC2_SYSDIV2_5          0x02000000  // System clock /5
#define SYSCTL_RCC2_SYSDIV2_6          0x02800000  // System clock /6
#define SYSCTL_RCC2_SYSDIV2_7          0x03000000  // System clock /7
#define SYSCTL_RCC2_SYSDIV2_8          0x03800000  // System clock /8
#define SYSCTL_RCC2_SYSDIV2_9          0x04000000  // System clock /9
#define SYSCTL_RCC2_SYSDIV2_10         0x04800000  // System clock /10
#define SYSCTL_RCC2_SYSDIV2_11         0x05000000  // System clock /11
#define SYSCTL_RCC2_SYSDIV2_12         0x05800000  // System clock /12
#define SYSCTL_RCC2_SYSDIV2_13         0x06000000  // System clock /13
#define SYSCTL_RCC2_SYSDIV2_14         0x06800000  // System clock /14
#define SYSCTL_RCC2_SYSDIV2_15         0x07000000  // System clock /15
#define SYSCTL_RCC2_SYSDIV2_16         0x07800000  // System clock /16
#define SYSCTL_RCC2_SYSDIV2_17         0x08000000  // System clock /17
#define SYSCTL_RCC2_SYSDIV2_18         0x08800000  // System clock /18
#define SYSCTL_RCC2_SYSDIV2_19         0x09000000  // System clock /19
#define SYSCTL_RCC2_SYSDIV2_20         0x09800000  // System clock /20
#define SYSCTL_RCC2_SYSDIV2_21         0x0A000000  // System clock /21
#define SYSCTL_RCC2_SYSDIV2_22         0x0A800000  // System clock /22
#define SYSCTL_RCC2_SYSDIV2_23         0x0B000000  // System clock /23
#define SYSCTL_RCC2_SYSDIV2_24         0x0B800000  // System clock /24
#define SYSCTL_RCC2_SYSDIV2_25         0x0C000000  // System clock /25
#define SYSCTL_RCC2_SYSDIV2_26         0x0C800000  // System clock /26
#define SYSCTL_RCC2_SYSDIV2_27         0x0D000000  // System clock /27
#define SYSCTL_RCC2_SYSDIV2_28         0x0D800000  // System clock /28
#define SYSCTL_RCC2_SYSDIV2_29         0x0E000000  // System clock /29
#define SYSCTL_RCC2_SYSDIV2_30         0x0E800000  // System clock /30
#define SYSCTL_RCC2_SYSDIV2_31         0x0F000000  // System clock /31
#define SYSCTL_RCC2_SYSDIV2_32         0x0F800000  // System clock /32
#define SYSCTL_RCC2_SYSDIV2_33         0x10000000  // System clock /33
#define SYSCTL_RCC2_SYSDIV2_34         0x10800000  // System clock /34
#define SYSCTL_RCC2_SYSDIV2_35         0x11000000  // System clock /35
#define SYSCTL_RCC2_SYSDIV2_36         0x11800000  // System clock /36
#define SYSCTL_RCC2_SYSDIV2_37         0x12000000  // System clock /37
#define SYSCTL_RCC2_SYSDIV2_38         0x12800000  // System clock /38
#define SYSCTL_RCC2_SYSDIV2_39         0x13000000  // System clock /39
#define SYSCTL_RCC2_SYSDIV2_40         0x13800000  // System clock /40
#define SYSCTL_RCC2_SYSDIV2_41         0x14000000  // System clock /41
#define SYSCTL_RCC2_SYSDIV2_42         0x14800000  // System clock /42
#define SYSCTL_RCC2_SYSDIV2_43         0x15000000  // System clock /43
#define SYSCTL_RCC2_SYSDIV2_44         0x15800000  // System clock /44
#define SYSCTL_RCC2_SYSDIV2_45         0x16000000  // System clock /45
#define SYSCTL_RCC2_SYSDIV2_46         0x16800000  // System clock /46
#define SYSCTL_RCC2_SYSDIV2_47         0x17000000  // System clock /47
#define SYSCTL_RCC2_SYSDIV2_48         0x17800000  // System clock /48
#define SYSCTL_RCC2_SYSDIV2_49         0x18000000  // System clock /49
#define SYSCTL_RCC2_SYSDIV2_50         0x18800000  // System clock /50
#define SYSCTL_RCC2_SYSDIV2_51         0x19000000  // System clock /51
#define SYSCTL_RCC2_SYSDIV2_52         0x19800000  // System clock /52
#define SYSCTL_RCC2_SYSDIV2_53         0x1A000000  // System clock /53
#define SYSCTL_RCC2_SYSDIV2_54         0x1A800000  // System clock /54
#define SYSCTL_RCC2_SYSDIV2_55         0x1B000000  // System clock /55
#define SYSCTL_RCC2_SYSDIV2_56         0x1B800000  // System clock /56
#define SYSCTL_RCC2_SYSDIV2_57         0x1C000000  // System clock /57
#define SYSCTL_RCC2_SYSDIV2_58         0x1C800000  // System clock /58
#define SYSCTL_RCC2_SYSDIV2_59         0x1D000000  // System clock /59
#define SYSCTL_RCC2_SYSDIV2_60         0x1D800000  // System clock /60
#define SYSCTL_RCC2_SYSDIV2_61         0x1E000000  // System clock /61
#define SYSCTL_RCC2_SYSDIV2_62         0x1E800000  // System clock /62
#define SYSCTL_RCC2_SYSDIV2_63         0x1F000000  // System clock /63
#define SYSCTL_RCC2_SYSDIV2_64         0x1F800000  // System clock /64
#define SYSCTL_RCC2_SYSDIV2LSB         0x00400000  // Additional LSB for SYSDIV2
#define SYSCTL_RCC2_USBPWRDN           0x00004000  // Power-Down USB PLL
#define SYSCTL_RCC2_PWRDN2             0x00002000  // Power-Down PLL 2
#define SYSCTL_RCC2_BYPASS2            0x00000800  // PLL Bypass 2
#define SYSCTL_RCC2_OSCSRC2_M          0x00000070  // Oscillator Source 2
#define SYSCTL_RCC2_OSCSRC2_MO         0x00000000  // MOSC
#define SYSCTL_RCC2_OSCSRC2_IO         0x00000010  // PIOSC
#define SYSCTL_RCC2_OSCSRC2_IO4        0x00000020  // PIOSC/4
#define SYSCTL_RCC2_OSCSRC2_30         0x00000030  // 30 kHz
#define SYSCTL_RCC2_OSCSRC2_419        0x00000060  // 4.194304 MHz
#define SYSCTL_RCC2_OSCSRC2_32         0x00000070  // 32.768 kHz
#define SYSCTL_RCC2_SYSDIV2_S          23

#define SYSCTL_MOSCCTL_NOXTAL          0x00000004  // No Crystal Connected
#define SYSCTL_MOSCCTL_MOSCIM          0x00000002  // MOSC Failure Action
#define SYSCTL_MOSCCTL_CVAL            0x00000001  // Clock Validation for MOSC

#define SYSCTL_RCGC0_WDT1              0x10000000  // WDT1 Clock Gating Control
#define SYSCTL_RCGC0_CAN2              0x04000000  // CAN2 Clock Gating Control
#define SYSCTL_RCGC0_CAN1              0x02000000  // CAN1 Clock Gating Control
#define SYSCTL_RCGC0_CAN0              0x01000000  // CAN0 Clock Gating Control
#define SYSCTL_RCGC0_PWM0              0x00100000  // PWM Clock Gating Control
#define SYSCTL_RCGC0_ADC1              0x00020000  // ADC1 Clock Gating Control
#define SYSCTL_RCGC0_ADC0              0x00010000  // ADC0 Clock Gating Control
#define SYSCTL_RCGC0_ADCSPD_M          0x00000F00  // ADC Sample Speed
#define SYSCTL_RCGC0_ADCSPD125K        0x00000000  // 125K samples/second
#define SYSCTL_RCGC0_ADCSPD250K        0x00000100  // 250K samples/second
#define SYSCTL_RCGC0_ADCSPD500K        0x00000200  // 500K samples/second
#define SYSCTL_RCGC0_ADCSPD1M          0x00000300  // 1M samples/second
#define SYSCTL_RCGC0_ADC1SPD_M         0x00000C00  // ADC1 Sample Speed
#define SYSCTL_RCGC0_ADC1SPD_125K      0x00000000  // 125K samples/second
#define SYSCTL_RCGC0_ADC1SPD_250K      0x00000400  // 250K samples/second
#define SYSCTL_RCGC0_ADC1SPD_500K      0x00000800  // 500K samples/second
#define SYSCTL_RCGC0_ADC1SPD_1M        0x00000C00  // 1M samples/second
#define SYSCTL_RCGC0_ADC0SPD_M         0x00000300  // ADC0 Sample Speed
#define SYSCTL_RCGC0_ADC0SPD_125K      0x00000000  // 125K samples/second
#define SYSCTL_RCGC0_ADC0SPD_250K      0x00000100  // 250K samples/second
#define SYSCTL_RCGC0_ADC0SPD_500K      0x00000200  // 500K samples/second
#define SYSCTL_RCGC0_ADC0SPD_1M        0x00000300  // 1M samples/second
#define SYSCTL_RCGC0_HIB               0x00000040  // HIB Clock Gating Control
#define SYSCTL_RCGC0_WDT0              0x00000008  // WDT0 Clock Gating Control

#define SYSCTL_RCGC1_EPI0              0x40000000  // EPI0 Clock Gating
#define SYSCTL_RCGC1_I2S0              0x10000000  // I2S0 Clock Gating
#define SYSCTL_RCGC1_COMP2             0x04000000  // Analog Comparator 2 Clock Gating
#define SYSCTL_RCGC1_COMP1             0x02000000  // Analog Comparator 1 Clock Gating
#define SYSCTL_RCGC1_COMP0             0x01000000  // Analog Comparator 0 Clock Gating
#define SYSCTL_RCGC1_TIMER3            0x00080000  // Timer 3 Clock Gating Control
#define SYSCTL_RCGC1_TIMER2            0x00040000  // Timer 2 Clock Gating Control
#define SYSCTL_RCGC1_TIMER1            0x00020000  // Timer 1 Clock Gating Control
#define SYSCTL_RCGC1_TIMER0            0x00010000  // Timer 0 Clock Gating Control
#define SYSCTL_RCGC1_I2C1              0x00004000  // I2C1 Clock Gating Control
#define SYSCTL_RCGC1_I2C0              0x00001000  // I2C0 Clock Gating Control
#define SYSCTL_RCGC1_QEI1              0x00000200  // QEI1 Clock Gating Control
#define SYSCTL_RCGC1_QEI0              0x00000100  // QEI0 Clock Gating Control
#define SYSCTL_RCGC1_SSI1              0x00000020  // SSI1 Clock Gating Control
#define SYSCTL_RCGC1_SSI0              0x00000010  // SSI0 Clock Gating Control
#define SYSCTL_RCGC1_UART2             0x00000004  // UART2 Clock Gating Control
#define SYSCTL_RCGC1_UART1             0x00000002  // UART1 Clock Gating Control
#define SYSCTL_RCGC1_UART0             0x00000001  // UART0 Clock Gating Control

#define SYSCTL_RCGC2_EPHY0             0x40000000  // PHY0 Clock Gating Control
#define SYSCTL_RCGC2_EMAC0             0x10000000  // MAC0 Clock Gating Control
#define SYSCTL_RCGC2_USB0              0x00010000  // USB0 Clock Gating Control
#define SYSCTL_RCGC2_UDMA              0x00002000  // Micro-DMA Clock Gating Control
#define SYSCTL_RCGC2_GPIOJ             0x00000100  // Port J Clock Gating Control
#define SYSCTL_RCGC2_GPIOH             0x00000080  // Port H Clock Gating Control
#define SYSCTL_RCGC2_GPIOG             0x00000040  // Port G Clock Gating Control
#define SYSCTL_RCGC2_GPIOF             0x00000020  // Port F Clock Gating Control
#define SYSCTL_RCGC2_GPIOE             0x00000010  // Port E Clock Gating Control
#define SYSCTL_RCGC2_GPIOD             0x00000008  // Port D Clock Gating Control
#define SYSCTL_RCGC2_GPIOC             0x00000004  // Port C Clock Gating Control
#define SYSCTL_RCGC2_GPIOB             0x00000002  // Port B Clock Gating Control
#define SYSCTL_RCGC2_GPIOA             0x00000001  // Port A Clock Gating Control

