lightelf76/FNET/fnet_stack/port/cpu/lm3s/lm3s_bits.h
#define SYSCTL_SCGC0_WDT1              0x10000000  // WDT1 Clock Gating Control
#define SYSCTL_SCGC0_CAN2              0x04000000  // CAN2 Clock Gating Control
#define SYSCTL_SCGC0_CAN1              0x02000000  // CAN1 Clock Gating Control
#define SYSCTL_SCGC0_CAN0              0x01000000  // CAN0 Clock Gating Control
#define SYSCTL_SCGC0_PWM0              0x00100000  // PWM Clock Gating Control
#define SYSCTL_SCGC0_ADC1              0x00020000  // ADC1 Clock Gating Control
#define SYSCTL_SCGC0_ADC0              0x00010000  // ADC0 Clock Gating Control
#define SYSCTL_SCGC0_ADCSPD_M          0x00000F00  // ADC Sample Speed
#define SYSCTL_SCGC0_ADCSPD125K        0x00000000  // 125K samples/second
#define SYSCTL_SCGC0_ADCSPD250K        0x00000100  // 250K samples/second
#define SYSCTL_SCGC0_ADCSPD500K        0x00000200  // 500K samples/second
#define SYSCTL_SCGC0_ADCSPD1M          0x00000300  // 1M samples/second
#define SYSCTL_SCGC0_ADC1SPD_M         0x00000C00  // ADC1 Sample Speed
#define SYSCTL_SCGC0_ADC1SPD_125K      0x00000000  // 125K samples/second
#define SYSCTL_SCGC0_ADC1SPD_250K      0x00000400  // 250K samples/second
#define SYSCTL_SCGC0_ADC1SPD_500K      0x00000800  // 500K samples/second
#define SYSCTL_SCGC0_ADC1SPD_1M        0x00000C00  // 1M samples/second
#define SYSCTL_SCGC0_ADC0SPD_M         0x00000300  // ADC0 Sample Speed
#define SYSCTL_SCGC0_ADC0SPD_125K      0x00000000  // 125K samples/second
#define SYSCTL_SCGC0_ADC0SPD_250K      0x00000100  // 250K samples/second
#define SYSCTL_SCGC0_ADC0SPD_500K      0x00000200  // 500K samples/second
#define SYSCTL_SCGC0_ADC0SPD_1M        0x00000300  // 1M samples/second
#define SYSCTL_SCGC0_HIB               0x00000040  // HIB Clock Gating Control
#define SYSCTL_SCGC0_WDT0              0x00000008  // WDT0 Clock Gating Control

#define SYSCTL_SCGC1_EPI0              0x40000000  // EPI0 Clock Gating
#define SYSCTL_SCGC1_I2S0              0x10000000  // I2S0 Clock Gating
#define SYSCTL_SCGC1_COMP2             0x04000000  // Analog Comparator 2 Clock Gating
#define SYSCTL_SCGC1_COMP1             0x02000000  // Analog Comparator 1 Clock Gating
#define SYSCTL_SCGC1_COMP0             0x01000000  // Analog Comparator 0 Clock Gating
#define SYSCTL_SCGC1_TIMER3            0x00080000  // Timer 3 Clock Gating Control
#define SYSCTL_SCGC1_TIMER2            0x00040000  // Timer 2 Clock Gating Control
#define SYSCTL_SCGC1_TIMER1            0x00020000  // Timer 1 Clock Gating Control
#define SYSCTL_SCGC1_TIMER0            0x00010000  // Timer 0 Clock Gating Control
#define SYSCTL_SCGC1_I2C1              0x00004000  // I2C1 Clock Gating Control
#define SYSCTL_SCGC1_I2C0              0x00001000  // I2C0 Clock Gating Control
#define SYSCTL_SCGC1_QEI1              0x00000200  // QEI1 Clock Gating Control
#define SYSCTL_SCGC1_QEI0              0x00000100  // QEI0 Clock Gating Control
#define SYSCTL_SCGC1_SSI1              0x00000020  // SSI1 Clock Gating Control
#define SYSCTL_SCGC1_SSI0              0x00000010  // SSI0 Clock Gating Control
#define SYSCTL_SCGC1_UART2             0x00000004  // UART2 Clock Gating Control
#define SYSCTL_SCGC1_UART1             0x00000002  // UART1 Clock Gating Control
#define SYSCTL_SCGC1_UART0             0x00000001  // UART0 Clock Gating Control

#define SYSCTL_SCGC2_EPHY0             0x40000000  // PHY0 Clock Gating Control
#define SYSCTL_SCGC2_EMAC0             0x10000000  // MAC0 Clock Gating Control
#define SYSCTL_SCGC2_USB0              0x00010000  // USB0 Clock Gating Control
#define SYSCTL_SCGC2_UDMA              0x00002000  // Micro-DMA Clock Gating Control
#define SYSCTL_SCGC2_GPIOJ             0x00000100  // Port J Clock Gating Control
#define SYSCTL_SCGC2_GPIOH             0x00000080  // Port H Clock Gating Control
#define SYSCTL_SCGC2_GPIOG             0x00000040  // Port G Clock Gating Control
#define SYSCTL_SCGC2_GPIOF             0x00000020  // Port F Clock Gating Control
#define SYSCTL_SCGC2_GPIOE             0x00000010  // Port E Clock Gating Control
#define SYSCTL_SCGC2_GPIOD             0x00000008  // Port D Clock Gating Control
#define SYSCTL_SCGC2_GPIOC             0x00000004  // Port C Clock Gating Control
#define SYSCTL_SCGC2_GPIOB             0x00000002  // Port B Clock Gating Control
#define SYSCTL_SCGC2_GPIOA             0x00000001  // Port A Clock Gating Control

#define SYSCTL_DCGC0_WDT1              0x10000000  // WDT1 Clock Gating Control
#define SYSCTL_DCGC0_CAN2              0x04000000  // CAN2 Clock Gating Control
#define SYSCTL_DCGC0_CAN1              0x02000000  // CAN1 Clock Gating Control
#define SYSCTL_DCGC0_CAN0              0x01000000  // CAN0 Clock Gating Control
#define SYSCTL_DCGC0_PWM0              0x00100000  // PWM Clock Gating Control
#define SYSCTL_DCGC0_ADC1              0x00020000  // ADC1 Clock Gating Control
#define SYSCTL_DCGC0_ADC0              0x00010000  // ADC0 Clock Gating Control
#define SYSCTL_DCGC0_HIB               0x00000040  // HIB Clock Gating Control
#define SYSCTL_DCGC0_WDT0              0x00000008  // WDT0 Clock Gating Control

#define SYSCTL_DCGC1_EPI0              0x40000000  // EPI0 Clock Gating
#define SYSCTL_DCGC1_I2S0              0x10000000  // I2S0 Clock Gating
#define SYSCTL_DCGC1_COMP2             0x04000000  // Analog Comparator 2 Clock Gating
#define SYSCTL_DCGC1_COMP1             0x02000000  // Analog Comparator 1 Clock Gating
#define SYSCTL_DCGC1_COMP0             0x01000000  // Analog Comparator 0 Clock Gating
#define SYSCTL_DCGC1_TIMER3            0x00080000  // Timer 3 Clock Gating Control
#define SYSCTL_DCGC1_TIMER2            0x00040000  // Timer 2 Clock Gating Control
#define SYSCTL_DCGC1_TIMER1            0x00020000  // Timer 1 Clock Gating Control
#define SYSCTL_DCGC1_TIMER0            0x00010000  // Timer 0 Clock Gating Control
#define SYSCTL_DCGC1_I2C1              0x00004000  // I2C1 Clock Gating Control
#define SYSCTL_DCGC1_I2C0              0x00001000  // I2C0 Clock Gating Control
#define SYSCTL_DCGC1_QEI1              0x00000200  // QEI1 Clock Gating Control
#define SYSCTL_DCGC1_QEI0              0x00000100  // QEI0 Clock Gating Control
#define SYSCTL_DCGC1_SSI1              0x00000020  // SSI1 Clock Gating Control
#define SYSCTL_DCGC1_SSI0              0x00000010  // SSI0 Clock Gating Control
#define SYSCTL_DCGC1_UART2             0x00000004  // UART2 Clock Gating Control
#define SYSCTL_DCGC1_UART1             0x00000002  // UART1 Clock Gating Control
#define SYSCTL_DCGC1_UART0             0x00000001  // UART0 Clock Gating Control

