lightelf76/FNET/fnet_stack/port/cpu/lm3s/lm3s_bits.h
#define SYSCTL_DCGC2_EPHY0             0x40000000  // PHY0 Clock Gating Control
#define SYSCTL_DCGC2_EMAC0             0x10000000  // MAC0 Clock Gating Control
#define SYSCTL_DCGC2_USB0              0x00010000  // USB0 Clock Gating Control
#define SYSCTL_DCGC2_UDMA              0x00002000  // Micro-DMA Clock Gating Control
#define SYSCTL_DCGC2_GPIOJ             0x00000100  // Port J Clock Gating Control
#define SYSCTL_DCGC2_GPIOH             0x00000080  // Port H Clock Gating Control
#define SYSCTL_DCGC2_GPIOG             0x00000040  // Port G Clock Gating Control
#define SYSCTL_DCGC2_GPIOF             0x00000020  // Port F Clock Gating Control
#define SYSCTL_DCGC2_GPIOE             0x00000010  // Port E Clock Gating Control
#define SYSCTL_DCGC2_GPIOD             0x00000008  // Port D Clock Gating Control
#define SYSCTL_DCGC2_GPIOC             0x00000004  // Port C Clock Gating Control
#define SYSCTL_DCGC2_GPIOB             0x00000002  // Port B Clock Gating Control
#define SYSCTL_DCGC2_GPIOA             0x00000001  // Port A Clock Gating Contro

#define SYSCTL_DSLPCLKCFG_D_M          0x1F800000  // Divider Field Override
#define SYSCTL_DSLPCLKCFG_D_1          0x00000000  // System clock /1
#define SYSCTL_DSLPCLKCFG_D_2          0x00800000  // System clock /2
#define SYSCTL_DSLPCLKCFG_D_3          0x01000000  // System clock /3
#define SYSCTL_DSLPCLKCFG_D_4          0x01800000  // System clock /4
#define SYSCTL_DSLPCLKCFG_D_5          0x02000000  // System clock /5
#define SYSCTL_DSLPCLKCFG_D_6          0x02800000  // System clock /6
#define SYSCTL_DSLPCLKCFG_D_7          0x03000000  // System clock /7
#define SYSCTL_DSLPCLKCFG_D_8          0x03800000  // System clock /8
#define SYSCTL_DSLPCLKCFG_D_9          0x04000000  // System clock /9
#define SYSCTL_DSLPCLKCFG_D_10         0x04800000  // System clock /10
#define SYSCTL_DSLPCLKCFG_D_11         0x05000000  // System clock /11
#define SYSCTL_DSLPCLKCFG_D_12         0x05800000  // System clock /12
#define SYSCTL_DSLPCLKCFG_D_13         0x06000000  // System clock /13
#define SYSCTL_DSLPCLKCFG_D_14         0x06800000  // System clock /14
#define SYSCTL_DSLPCLKCFG_D_15         0x07000000  // System clock /15
#define SYSCTL_DSLPCLKCFG_D_16         0x07800000  // System clock /16
#define SYSCTL_DSLPCLKCFG_D_17         0x08000000  // System clock /17
#define SYSCTL_DSLPCLKCFG_D_18         0x08800000  // System clock /18
#define SYSCTL_DSLPCLKCFG_D_19         0x09000000  // System clock /19
#define SYSCTL_DSLPCLKCFG_D_20         0x09800000  // System clock /20
#define SYSCTL_DSLPCLKCFG_D_21         0x0A000000  // System clock /21
#define SYSCTL_DSLPCLKCFG_D_22         0x0A800000  // System clock /22
#define SYSCTL_DSLPCLKCFG_D_23         0x0B000000  // System clock /23
#define SYSCTL_DSLPCLKCFG_D_24         0x0B800000  // System clock /24
#define SYSCTL_DSLPCLKCFG_D_25         0x0C000000  // System clock /25
#define SYSCTL_DSLPCLKCFG_D_26         0x0C800000  // System clock /26
#define SYSCTL_DSLPCLKCFG_D_27         0x0D000000  // System clock /27
#define SYSCTL_DSLPCLKCFG_D_28         0x0D800000  // System clock /28
#define SYSCTL_DSLPCLKCFG_D_29         0x0E000000  // System clock /29
#define SYSCTL_DSLPCLKCFG_D_30         0x0E800000  // System clock /30
#define SYSCTL_DSLPCLKCFG_D_31         0x0F000000  // System clock /31
#define SYSCTL_DSLPCLKCFG_D_32         0x0F800000  // System clock /32
#define SYSCTL_DSLPCLKCFG_D_33         0x10000000  // System clock /33
#define SYSCTL_DSLPCLKCFG_D_34         0x10800000  // System clock /34
#define SYSCTL_DSLPCLKCFG_D_35         0x11000000  // System clock /35
#define SYSCTL_DSLPCLKCFG_D_36         0x11800000  // System clock /36
#define SYSCTL_DSLPCLKCFG_D_37         0x12000000  // System clock /37
#define SYSCTL_DSLPCLKCFG_D_38         0x12800000  // System clock /38
#define SYSCTL_DSLPCLKCFG_D_39         0x13000000  // System clock /39
#define SYSCTL_DSLPCLKCFG_D_40         0x13800000  // System clock /40
#define SYSCTL_DSLPCLKCFG_D_41         0x14000000  // System clock /41
#define SYSCTL_DSLPCLKCFG_D_42         0x14800000  // System clock /42
#define SYSCTL_DSLPCLKCFG_D_43         0x15000000  // System clock /43
#define SYSCTL_DSLPCLKCFG_D_44         0x15800000  // System clock /44
#define SYSCTL_DSLPCLKCFG_D_45         0x16000000  // System clock /45
#define SYSCTL_DSLPCLKCFG_D_46         0x16800000  // System clock /46
#define SYSCTL_DSLPCLKCFG_D_47         0x17000000  // System clock /47
#define SYSCTL_DSLPCLKCFG_D_48         0x17800000  // System clock /48
#define SYSCTL_DSLPCLKCFG_D_49         0x18000000  // System clock /49
#define SYSCTL_DSLPCLKCFG_D_50         0x18800000  // System clock /50
#define SYSCTL_DSLPCLKCFG_D_51         0x19000000  // System clock /51
#define SYSCTL_DSLPCLKCFG_D_52         0x19800000  // System clock /52
#define SYSCTL_DSLPCLKCFG_D_53         0x1A000000  // System clock /53
#define SYSCTL_DSLPCLKCFG_D_54         0x1A800000  // System clock /54
#define SYSCTL_DSLPCLKCFG_D_55         0x1B000000  // System clock /55
#define SYSCTL_DSLPCLKCFG_D_56         0x1B800000  // System clock /56
#define SYSCTL_DSLPCLKCFG_D_57         0x1C000000  // System clock /57
#define SYSCTL_DSLPCLKCFG_D_58         0x1C800000  // System clock /58
#define SYSCTL_DSLPCLKCFG_D_59         0x1D000000  // System clock /59
#define SYSCTL_DSLPCLKCFG_D_60         0x1D800000  // System clock /60
#define SYSCTL_DSLPCLKCFG_D_61         0x1E000000  // System clock /61
#define SYSCTL_DSLPCLKCFG_D_62         0x1E800000  // System clock /62
#define SYSCTL_DSLPCLKCFG_D_63         0x1F000000  // System clock /63
#define SYSCTL_DSLPCLKCFG_D_64         0x1F800000  // System clock /64
#define SYSCTL_DSLPCLKCFG_O_M          0x00000070  // Clock Source
#define SYSCTL_DSLPCLKCFG_O_IGN        0x00000000  // MOSC
#define SYSCTL_DSLPCLKCFG_O_IO         0x00000010  // PIOSC
#define SYSCTL_DSLPCLKCFG_O_30         0x00000030  // 30 kHz
#define SYSCTL_DSLPCLKCFG_O_32         0x00000070  // 32.768 kHz
#define SYSCTL_DSLPCLKCFG_PIOSCPD      0x00000002  // PIOSC Power Down Request
#define SYSCTL_DSLPCLKCFG_IOSC         0x00000001  // IOSC Clock Source
#define SYSCTL_DSLPCLKCFG_D_S          23

