lightelf76/FNET/fnet_stack/port/cpu/lm3s/lm3s_bits.h
#define SYSCTL_PIOSCCAL_UTEN           0x80000000  // Use User Trim Value
#define SYSCTL_PIOSCCAL_CAL            0x00000200  // Start Calibration
#define SYSCTL_PIOSCCAL_UPDATE         0x00000100  // Update Trim
#define SYSCTL_PIOSCCAL_UT_M           0x0000007F  // User Trim Value
#define SYSCTL_PIOSCCAL_UT_S           0

#define SYSCTL_PIOSCSTAT_DT_M          0x007F0000  // Default Trim Value
#define SYSCTL_PIOSCSTAT_CR_M          0x00000300  // Calibration Result
#define SYSCTL_PIOSCSTAT_CRNONE        0x00000000  // Calibration has not been attempted
#define SYSCTL_PIOSCSTAT_CRPASS        0x00000100  // The last calibration operation completed to meet 1% accuracy
#define SYSCTL_PIOSCSTAT_CRFAIL        0x00000200  // The last calibration operation failed to meet 1% accuracy
#define SYSCTL_PIOSCSTAT_CT_M          0x0000007F  // Calibration Trim Value
#define SYSCTL_PIOSCSTAT_DT_S          16
#define SYSCTL_PIOSCSTAT_CT_S          0

#define SYSCTL_LDOARST_LDOARST         0x00000001  // LDO Reset

#define SYSCTL_I2SMCLKCFG_RXEN         0x80000000  // RX Clock Enable
#define SYSCTL_I2SMCLKCFG_RXI_M        0x3FF00000  // RX Clock Integer Input
#define SYSCTL_I2SMCLKCFG_RXF_M        0x000F0000  // RX Clock Fractional Input
#define SYSCTL_I2SMCLKCFG_TXEN         0x00008000  // TX Clock Enable
#define SYSCTL_I2SMCLKCFG_TXI_M        0x00003FF0  // TX Clock Integer Input
#define SYSCTL_I2SMCLKCFG_TXF_M        0x0000000F  // TX Clock Fractional Input
#define SYSCTL_I2SMCLKCFG_RXI_S        20
#define SYSCTL_I2SMCLKCFG_RXF_S        16
#define SYSCTL_I2SMCLKCFG_TXI_S        4
#define SYSCTL_I2SMCLKCFG_TXF_S        0

#define SYSCTL_DC9_ADC1DC7             0x00800000  // ADC1 DC7 Present
#define SYSCTL_DC9_ADC1DC6             0x00400000  // ADC1 DC6 Present
#define SYSCTL_DC9_ADC1DC5             0x00200000  // ADC1 DC5 Present
#define SYSCTL_DC9_ADC1DC4             0x00100000  // ADC1 DC4 Present
#define SYSCTL_DC9_ADC1DC3             0x00080000  // ADC1 DC3 Present
#define SYSCTL_DC9_ADC1DC2             0x00040000  // ADC1 DC2 Present
#define SYSCTL_DC9_ADC1DC1             0x00020000  // ADC1 DC1 Present
#define SYSCTL_DC9_ADC1DC0             0x00010000  // ADC1 DC0 Present
#define SYSCTL_DC9_ADC0DC7             0x00000080  // ADC0 DC7 Present
#define SYSCTL_DC9_ADC0DC6             0x00000040  // ADC0 DC6 Present
#define SYSCTL_DC9_ADC0DC5             0x00000020  // ADC0 DC5 Present
#define SYSCTL_DC9_ADC0DC4             0x00000010  // ADC0 DC4 Present
#define SYSCTL_DC9_ADC0DC3             0x00000008  // ADC0 DC3 Present
#define SYSCTL_DC9_ADC0DC2             0x00000004  // ADC0 DC2 Present
#define SYSCTL_DC9_ADC0DC1             0x00000002  // ADC0 DC1 Present
#define SYSCTL_DC9_ADC0DC0             0x00000001  // ADC0 DC0 Present

#define SYSCTL_NVMSTAT_TPSW            0x00000010  // Third Party Software Present
#define SYSCTL_NVMSTAT_FWB             0x00000001  // 32 Word Flash Write Buffer Active

//**************************************************************************************************
// WATCHDOG
//**************************************************************************************************
// short name
#define WDT                            WATCHDOG0 
                                       
#define WDT_CTL_RESEN                  0x00000002  // Watchdog Reset Enable
#define WDT_CTL_INTEN                  0x00000001  // Watchdog Interrupt Enable
                                       
#define WDT_RIS_WDTRIS                 0x00000001  // Watchdog Raw Interrupt Status
                                       
#define WDT_MIS_WDTMIS                 0x00000001  // Watchdog Masked Interrupt Status
                                       
#define WDT_TEST_STALL                 0x00000100  // Watchdog Stall Enable
                                       
#define WDT_LOCK_LOCKED                0x00000001  // Locked
#define WDT_LOCK_UNLOCK                0x1ACCE551  // Unlocks the watchdog timer

//**************************************************************************************************
// GPIO
//**************************************************************************************************
#define GPIO_LOCK_LOCKED               0x00000001  // The GPIOCR register is locked and may not be modified
#define GPIO_LOCK_KEY                  0x1ACCE551  // Unlocks the GPIO_CR register

//**************************************************************************************************
// SSI
//**************************************************************************************************
#define SSI_CR0_SCR_M                  0x0000FF00  // SSI Serial Clock Rate
#define SSI_CR0_SPH                    0x00000080  // SSI Serial Clock Phase
#define SSI_CR0_SPO                    0x00000040  // SSI Serial Clock Polarity
#define SSI_CR0_FRF_M                  0x00000030  // SSI Frame Format Select
#define SSI_CR0_FRF_MOTO               0x00000000  // Freescale SPI Frame Format
#define SSI_CR0_FRF_TI                 0x00000010  // Texas Instruments Synchronous Serial Frame Format
#define SSI_CR0_FRF_NMW                0x00000020  // MICROWIRE Frame Format
#define SSI_CR0_DSS_M                  0x0000000F  // SSI Data Size Select
#define SSI_CR0_DSS_4                  0x00000003  // 4-bit data
#define SSI_CR0_DSS_5                  0x00000004  // 5-bit data
#define SSI_CR0_DSS_6                  0x00000005  // 6-bit data
#define SSI_CR0_DSS_7                  0x00000006  // 7-bit data
#define SSI_CR0_DSS_8                  0x00000007  // 8-bit data
#define SSI_CR0_DSS_9                  0x00000008  // 9-bit data
#define SSI_CR0_DSS_10                 0x00000009  // 10-bit data
#define SSI_CR0_DSS_11                 0x0000000A  // 11-bit data
#define SSI_CR0_DSS_12                 0x0000000B  // 12-bit data
#define SSI_CR0_DSS_13                 0x0000000C  // 13-bit data
#define SSI_CR0_DSS_14                 0x0000000D  // 14-bit data
#define SSI_CR0_DSS_15                 0x0000000E  // 15-bit data
#define SSI_CR0_DSS_16                 0x0000000F  // 16-bit data
#define SSI_CR0_SCR_S                  8

#define SSI_CR1_SOD                    0x00000008  // SSI Slave Mode Output Disable
#define SSI_CR1_MS                     0x00000004  // SSI Master/Slave Select
#define SSI_CR1_SSE                    0x00000002  // SSI Synchronous Serial Port Enable
#define SSI_CR1_LBM                    0x00000001  // SSI Loopback Mode
                                       
#define SSI_DR_DATA_M                  0x0000FFFF  // SSI Receive/Transmit Data
#define SSI_DR_DATA_S                  0
                                       
#define SSI_SR_BSY                     0x00000010  // SSI Busy Bit
#define SSI_SR_RFF                     0x00000008  // SSI Receive FIFO Full
#define SSI_SR_RNE                     0x00000004  // SSI Receive FIFO Not Empty
#define SSI_SR_TNF                     0x00000002  // SSI Transmit FIFO Not Full
#define SSI_SR_TFE                     0x00000001  // SSI Transmit FIFO Empty
                                       
