lightelf76/FNET/fnet_stack/port/cpu/lm3s/lm3s_bits.h
#define UART_DMACTL_DMAERR             0x00000004  // DMA on Error
#define UART_DMACTL_TXDMAE             0x00000002  // Transmit DMA Enable
#define UART_DMACTL_RXDMAE             0x00000001  // Receive DMA Enable

#define UART_LCTL_BLEN_M               0x00000030  // Sync Break Length
#define UART_LCTL_BLEN_13T             0x00000000  // Sync break length is 13T bits (default)
#define UART_LCTL_BLEN_14T             0x00000010  // Sync break length is 14T bits
#define UART_LCTL_BLEN_15T             0x00000020  // Sync break length is 15T bits
#define UART_LCTL_BLEN_16T             0x00000030  // Sync break length is 16T bits
#define UART_LCTL_MASTER               0x00000001  // LIN Master Enable

#define UART_LSS_TSS_M                 0x0000FFFF  // Timer Snap Shot
#define UART_LSS_TSS_S                 0

#define UART_LTIM_TIMER_M              0x0000FFFF  // Timer Value
#define UART_LTIM_TIMER_S              0

//**************************************************************************************************
// I2C
//**************************************************************************************************
#define I2C_MSA_SA_M                   0x000000FE  // I2C Slave Address
#define I2C_MSA_RS                     0x00000001  // Receive not send
#define I2C_MSA_SA_S                   1
                                       
#define I2C_SOAR_OAR_M                 0x0000007F  // I2C Slave Own Address
#define I2C_SOAR_OAR_S                 0

#define I2C_SCSR_QCMDRW                0x00000020  // Quick Command Read / Write
#define I2C_SCSR_QCMDST                0x00000010  // Quick Command Status
#define I2C_SCSR_OAR2SEL               0x00000008  // OAR2 Address Matched
#define I2C_SCSR_FBR                   0x00000004  // First Byte Received
#define I2C_SCSR_TREQ                  0x00000002  // Transmit Request
#define I2C_SCSR_DA                    0x00000001  // Device Active
#define I2C_SCSR_RREQ                  0x00000001  // Receive Request

#define I2C_MCS_CLKTO                  0x00000080  // Clock Timeout Error
#define I2C_MCS_BUSBSY                 0x00000040  // Bus Busy
#define I2C_MCS_IDLE                   0x00000020  // I2C Idle
#define I2C_MCS_QCMD                   0x00000020  // Quick Command
#define I2C_MCS_ARBLST                 0x00000010  // Arbitration Lost
#define I2C_MCS_HS                     0x00000010  // High-Speed Enable
#define I2C_MCS_ACK                    0x00000008  // Data Acknowledge Enable
#define I2C_MCS_DATACK                 0x00000008  // Acknowledge Data
#define I2C_MCS_ADRACK                 0x00000004  // Acknowledge Address
#define I2C_MCS_STOP                   0x00000004  // Generate STOP
#define I2C_MCS_START                  0x00000002  // Generate START
#define I2C_MCS_ERROR                  0x00000002  // Error
#define I2C_MCS_RUN                    0x00000001  // I2C Master Enable
#define I2C_MCS_BUSY                   0x00000001  // I2C Busy

#define I2C_SDR_DATA_M                 0x000000FF  // Data for Transfer
#define I2C_SDR_DATA_S                 0
                                       
#define I2C_MDR_DATA_M                 0x000000FF  // Data Transferred
#define I2C_MDR_DATA_S                 0
                                       
#define I2C_MTPR_HS                    0x00000080  // High-Speed Enable
#define I2C_MTPR_TPR_M                 0x0000007F  // SCL Clock Period
#define I2C_MTPR_TPR_S                 0

#define I2C_SIMR_STOPIM                0x00000004  // Stop Condition Interrupt Mask
#define I2C_SIMR_STARTIM               0x00000002  // Start Condition Interrupt Mask
#define I2C_SIMR_DATAIM                0x00000001  // Data Interrupt Mask

#define I2C_SRIS_STOPRIS               0x00000004  // Stop Condition Raw Interrupt Status
#define I2C_SRIS_STARTRIS              0x00000002  // Start Condition Raw Interrupt Status
#define I2C_SRIS_DATARIS               0x00000001  // Data Raw Interrupt Status

#define I2C_MIMR_CLKIM                 0x00000002  // Clock Timeout Interrupt Mask
#define I2C_MIMR_IM                    0x00000001  // Master Interrupt Mask

#define I2C_MRIS_CLKRIS                0x00000002  // Clock Timeout Raw Interrupt Status
#define I2C_MRIS_RIS                   0x00000001  // Master Raw Interrupt Status

#define I2C_SMIS_STOPMIS               0x00000004  // Stop Condition Masked Interrupt Status
#define I2C_SMIS_STARTMIS              0x00000002  // Start Condition Masked Interrupt Status
#define I2C_SMIS_DATAMIS               0x00000001  // Data Masked Interrupt Status

#define I2C_SICR_STOPIC                0x00000004  // Stop Condition Interrupt Clear
#define I2C_SICR_STARTIC               0x00000002  // Start Condition Interrupt Clear
#define I2C_SICR_DATAIC                0x00000001  // Data Interrupt Clear

#define I2C_MMIS_CLKMIS                0x00000002  // Clock Timeout Masked Interrupt Status
#define I2C_MMIS_MIS                   0x00000001  // Masked Interrupt Status

#define I2C_MICR_CLKIC                 0x00000002  // Clock Timeout Interrupt Clear
#define I2C_MICR_IC                    0x00000001  // Master Interrupt Clear

#define I2C_SOAR2_OAR2EN               0x00000080  // I2C Slave Own Address 2 Enable
#define I2C_SOAR2_OAR2_M               0x0000007F  // I2C Slave Own Address 2
#define I2C_SOAR2_OAR2_S               0

#define I2C_MCR_SFE                    0x00000020  // I2C Slave Function Enable
#define I2C_MCR_MFE                    0x00000010  // I2C Master Function Enable
#define I2C_MCR_LPBK                   0x00000001  // I2C Loopback

//**************************************************************************************************
// PWM
//**************************************************************************************************
#define PWM_CTL_GLOBALSYNC2            0x00000004  // Update PWM Generator 2
#define PWM_CTL_GLOBALSYNC1            0x00000002  // Update PWM Generator 1
#define PWM_CTL_GLOBALSYNC0            0x00000001  // Update PWM Generator 0
                                       
