lightelf76/FNET/fnet_stack/port/cpu/lm3s/lm3s_bits.h
#define PWM_SYNC_SYNC2                 0x00000004  // Reset Generator 2 Counter
#define PWM_SYNC_SYNC1                 0x00000002  // Reset Generator 1 Counter
#define PWM_SYNC_SYNC0                 0x00000001  // Reset Generator 0 Counter
                                       
#define PWM_ENABLE_PWM5EN              0x00000020  // PWM5 Output Enable
#define PWM_ENABLE_PWM4EN              0x00000010  // PWM4 Output Enable
#define PWM_ENABLE_PWM3EN              0x00000008  // PWM3 Output Enable
#define PWM_ENABLE_PWM2EN              0x00000004  // PWM2 Output Enable
#define PWM_ENABLE_PWM1EN              0x00000002  // PWM1 Output Enable
#define PWM_ENABLE_PWM0EN              0x00000001  // PWM0 Output Enable
                                       
#define PWM_INVERT_PWM5INV             0x00000020  // Invert PWM5 Signal
#define PWM_INVERT_PWM4INV             0x00000010  // Invert PWM4 Signal
#define PWM_INVERT_PWM3INV             0x00000008  // Invert PWM3 Signal
#define PWM_INVERT_PWM2INV             0x00000004  // Invert PWM2 Signal
#define PWM_INVERT_PWM1INV             0x00000002  // Invert PWM1 Signal
#define PWM_INVERT_PWM0INV             0x00000001  // Invert PWM0 Signal
                                       
#define PWM_FAULT_FAULT5               0x00000020  // PWM5 Fault
#define PWM_FAULT_FAULT4               0x00000010  // PWM4 Fault
#define PWM_FAULT_FAULT3               0x00000008  // PWM3 Fault
#define PWM_FAULT_FAULT2               0x00000004  // PWM2 Fault
#define PWM_FAULT_FAULT1               0x00000002  // PWM1 Fault
#define PWM_FAULT_FAULT0               0x00000001  // PWM0 Fault
                                       
#define PWM_INTEN_INTFAULT             0x00010000  // Fault Interrupt Enable
#define PWM_INTEN_INTPWM2              0x00000004  // PWM2 Interrupt Enable
#define PWM_INTEN_INTPWM1              0x00000002  // PWM1 Interrupt Enable
#define PWM_INTEN_INTPWM0              0x00000001  // PWM0 Interrupt Enable

#define PWM_RIS_INTFAULT               0x00010000  // Fault Interrupt Asserted
#define PWM_RIS_INTPWM2                0x00000004  // PWM2 Interrupt Asserted
#define PWM_RIS_INTPWM1                0x00000002  // PWM1 Interrupt Asserted
#define PWM_RIS_INTPWM0                0x00000001  // PWM0 Interrupt Asserted
                                       
#define PWM_ISC_INTFAULT               0x00010000  // Fault Interrupt Asserted
#define PWM_ISC_INTPWM2                0x00000004  // PWM2 Interrupt Status
#define PWM_ISC_INTPWM1                0x00000002  // PWM1 Interrupt Status
#define PWM_ISC_INTPWM0                0x00000001  // PWM0 Interrupt Status
                                       
#define PWM_STATUS_FAULT               0x00000001  // Fault Interrupt Status
                                       
#define PWM_X_CTL_CMPBUPD              0x00000020  // Comparator B Update Mode
#define PWM_X_CTL_CMPAUPD              0x00000010  // Comparator A Update Mode
#define PWM_X_CTL_LOADUPD              0x00000008  // Load Register Update Mode
#define PWM_X_CTL_DEBUG                0x00000004  // Debug Mode
#define PWM_X_CTL_MODE                 0x00000002  // Counter Mode
#define PWM_X_CTL_ENABLE               0x00000001  // PWM Block Enable
                                       
#define PWM_X_INTEN_TRCMPBD            0x00002000  // Trigger for Counter=PWMnCMPB Down
#define PWM_X_INTEN_TRCMPBU            0x00001000  // Trigger for Counter=PWMnCMPB Up
#define PWM_X_INTEN_TRCMPAD            0x00000800  // Trigger for Counter=PWMnCMPA Down
#define PWM_X_INTEN_TRCMPAU            0x00000400  // Trigger for Counter=PWMnCMPA Up
#define PWM_X_INTEN_TRCNTLOAD          0x00000200  // Trigger for Counter=PWMnLOAD
#define PWM_X_INTEN_TRCNTZERO          0x00000100  // Trigger for Counter=0
#define PWM_X_INTEN_INTCMPBD           0x00000020  // Interrupt for Counter=PWMnCMPB Down
#define PWM_X_INTEN_INTCMPBU           0x00000010  // Interrupt for Counter=PWMnCMPB Up
#define PWM_X_INTEN_INTCMPAD           0x00000008  // Interrupt for Counter=PWMnCMPA Down
#define PWM_X_INTEN_INTCMPAU           0x00000004  // Interrupt for Counter=PWMnCMPA Up
#define PWM_X_INTEN_INTCNTLOAD         0x00000002  // Interrupt for Counter=PWMnLOAD
#define PWM_X_INTEN_INTCNTZERO         0x00000001  // Interrupt for Counter=0
                                       
#define PWM_X_RIS_INTCMPBD             0x00000020  // Comparator B Down Interrupt Status
#define PWM_X_RIS_INTCMPBU             0x00000010  // Comparator B Up Interrupt Status
#define PWM_X_RIS_INTCMPAD             0x00000008  // Comparator A Down Interrupt Status
#define PWM_X_RIS_INTCMPAU             0x00000004  // Comparator A Up Interrupt Status
#define PWM_X_RIS_INTCNTLOAD           0x00000002  // Counter=Load Interrupt Status
#define PWM_X_RIS_INTCNTZERO           0x00000001  // Counter=0 Interrupt Status

#define PWM_X_ISC_INTCMPBD             0x00000020  // Comparator B Down Interrupt
#define PWM_X_ISC_INTCMPBU             0x00000010  // Comparator B Up Interrupt
#define PWM_X_ISC_INTCMPAD             0x00000008  // Comparator A Down Interrupt
#define PWM_X_ISC_INTCMPAU             0x00000004  // Comparator A Up Interrupt
#define PWM_X_ISC_INTCNTLOAD           0x00000002  // Counter=Load Interrupt
#define PWM_X_ISC_INTCNTZERO           0x00000001  // Counter=0 Interrupt
                                       
#define PWM_X_LOAD_M                   0x0000FFFF  // Counter Load Value
#define PWM_X_LOAD_S                   0
                                       
#define PWM_X_COUNT_M                  0x0000FFFF  // Counter Value
#define PWM_X_COUNT_S                  0
                                       
#define PWM_X_CMPA_M                   0x0000FFFF  // Comparator A Value
#define PWM_X_CMPA_S                   0
                                       
#define PWM_X_CMPB_M                   0x0000FFFF  // Comparator B Value
#define PWM_X_CMPB_S                   0

#define PWM_X_GENA_ACTCMPBD_M          0x00000C00  // Action for Comparator B Down
#define PWM_X_GENA_ACTCMPBD_NONE       0x00000000  // Do nothing
#define PWM_X_GENA_ACTCMPBD_INV        0x00000400  // Invert pwmA
#define PWM_X_GENA_ACTCMPBD_ZERO       0x00000800  // Drive pwmA Low
#define PWM_X_GENA_ACTCMPBD_ONE        0x00000C00  // Drive pwmA High
#define PWM_X_GENA_ACTCMPBU_M          0x00000300  // Action for Comparator B Up
#define PWM_X_GENA_ACTCMPBU_NONE       0x00000000  // Do nothing
#define PWM_X_GENA_ACTCMPBU_INV        0x00000100  // Invert pwmA
#define PWM_X_GENA_ACTCMPBU_ZERO       0x00000200  // Drive pwmA Low
#define PWM_X_GENA_ACTCMPBU_ONE        0x00000300  // Drive pwmA High
#define PWM_X_GENA_ACTCMPAD_M          0x000000C0  // Action for Comparator A Down
#define PWM_X_GENA_ACTCMPAD_NONE       0x00000000  // Do nothing
#define PWM_X_GENA_ACTCMPAD_INV        0x00000040  // Invert pwmA
#define PWM_X_GENA_ACTCMPAD_ZERO       0x00000080  // Drive pwmA Low
#define PWM_X_GENA_ACTCMPAD_ONE        0x000000C0  // Drive pwmA High
#define PWM_X_GENA_ACTCMPAU_M          0x00000030  // Action for Comparator A Up
#define PWM_X_GENA_ACTCMPAU_NONE       0x00000000  // Do nothing
#define PWM_X_GENA_ACTCMPAU_INV        0x00000010  // Invert pwmA
#define PWM_X_GENA_ACTCMPAU_ZERO       0x00000020  // Drive pwmA Low
#define PWM_X_GENA_ACTCMPAU_ONE        0x00000030  // Drive pwmA High
#define PWM_X_GENA_ACTLOAD_M           0x0000000C  // Action for Counter=LOAD
#define PWM_X_GENA_ACTLOAD_NONE        0x00000000  // Do nothing
#define PWM_X_GENA_ACTLOAD_INV         0x00000004  // Invert pwmA
#define PWM_X_GENA_ACTLOAD_ZERO        0x00000008  // Drive pwmA Low
#define PWM_X_GENA_ACTLOAD_ONE         0x0000000C  // Drive pwmA High
#define PWM_X_GENA_ACTZERO_M           0x00000003  // Action for Counter=0
#define PWM_X_GENA_ACTZERO_NONE        0x00000000  // Do nothing
#define PWM_X_GENA_ACTZERO_INV         0x00000001  // Invert pwmA
#define PWM_X_GENA_ACTZERO_ZERO        0x00000002  // Drive pwmA Low
#define PWM_X_GENA_ACTZERO_ONE         0x00000003  // Drive pwmA High
                                       
