lightelf76/FNET/fnet_stack/port/cpu/lm3s/lm3s_bits.h
#define PWM_X_GENB_ACTCMPBD_M          0x00000C00  // Action for Comparator B Down
#define PWM_X_GENB_ACTCMPBD_NONE       0x00000000  // Do nothing
#define PWM_X_GENB_ACTCMPBD_INV        0x00000400  // Invert pwmB
#define PWM_X_GENB_ACTCMPBD_ZERO       0x00000800  // Drive pwmB Low
#define PWM_X_GENB_ACTCMPBD_ONE        0x00000C00  // Drive pwmB High
#define PWM_X_GENB_ACTCMPBU_M          0x00000300  // Action for Comparator B Up
#define PWM_X_GENB_ACTCMPBU_NONE       0x00000000  // Do nothing
#define PWM_X_GENB_ACTCMPBU_INV        0x00000100  // Invert pwmB
#define PWM_X_GENB_ACTCMPBU_ZERO       0x00000200  // Drive pwmB Low
#define PWM_X_GENB_ACTCMPBU_ONE        0x00000300  // Drive pwmB High
#define PWM_X_GENB_ACTCMPAD_M          0x000000C0  // Action for Comparator A Down
#define PWM_X_GENB_ACTCMPAD_NONE       0x00000000  // Do nothing
#define PWM_X_GENB_ACTCMPAD_INV        0x00000040  // Invert pwmB
#define PWM_X_GENB_ACTCMPAD_ZERO       0x00000080  // Drive pwmB Low
#define PWM_X_GENB_ACTCMPAD_ONE        0x000000C0  // Drive pwmB High
#define PWM_X_GENB_ACTCMPAU_M          0x00000030  // Action for Comparator A Up
#define PWM_X_GENB_ACTCMPAU_NONE       0x00000000  // Do nothing
#define PWM_X_GENB_ACTCMPAU_INV        0x00000010  // Invert pwmB
#define PWM_X_GENB_ACTCMPAU_ZERO       0x00000020  // Drive pwmB Low
#define PWM_X_GENB_ACTCMPAU_ONE        0x00000030  // Drive pwmB High
#define PWM_X_GENB_ACTLOAD_M           0x0000000C  // Action for Counter=LOAD
#define PWM_X_GENB_ACTLOAD_NONE        0x00000000  // Do nothing
#define PWM_X_GENB_ACTLOAD_INV         0x00000004  // Invert pwmB
#define PWM_X_GENB_ACTLOAD_ZERO        0x00000008  // Drive pwmB Low
#define PWM_X_GENB_ACTLOAD_ONE         0x0000000C  // Drive pwmB High
#define PWM_X_GENB_ACTZERO_M           0x00000003  // Action for Counter=0
#define PWM_X_GENB_ACTZERO_NONE        0x00000000  // Do nothing
#define PWM_X_GENB_ACTZERO_INV         0x00000001  // Invert pwmB
#define PWM_X_GENB_ACTZERO_ZERO        0x00000002  // Drive pwmB Low
#define PWM_X_GENB_ACTZERO_ONE         0x00000003  // Drive pwmB High
                                      
#define PWM_X_DBCTL_ENABLE             0x00000001  // Dead-Band Generator Enable
                                      
#define PWM_X_DBRISE_DELAY_M           0x00000FFF  // Dead-Band Rise Delay
#define PWM_X_DBRISE_DELAY_S           0
                                      
#define PWM_X_DBFALL_DELAY_M           0x00000FFF  // Dead-Band Fall Delay
#define PWM_X_DBFALL_DELAY_S           0

//**************************************************************************************************
// QEI
//**************************************************************************************************
#define QEI_CTL_STALLEN                0x00001000  // Stall QEI
#define QEI_CTL_INVI                   0x00000800  // Invert Index Pulse
#define QEI_CTL_INVB                   0x00000400  // Invert PhB
#define QEI_CTL_INVA                   0x00000200  // Invert PhA
#define QEI_CTL_VELDIV_M               0x000001C0  // Predivide Velocity
#define QEI_CTL_VELDIV_1               0x00000000  // QEI clock /1
#define QEI_CTL_VELDIV_2               0x00000040  // QEI clock /2
#define QEI_CTL_VELDIV_4               0x00000080  // QEI clock /4
#define QEI_CTL_VELDIV_8               0x000000C0  // QEI clock /8
#define QEI_CTL_VELDIV_16              0x00000100  // QEI clock /16
#define QEI_CTL_VELDIV_32              0x00000140  // QEI clock /32
#define QEI_CTL_VELDIV_64              0x00000180  // QEI clock /64
#define QEI_CTL_VELDIV_128             0x000001C0  // QEI clock /128
#define QEI_CTL_VELEN                  0x00000020  // Capture Velocity
#define QEI_CTL_RESMODE                0x00000010  // Reset Mode
#define QEI_CTL_CAPMODE                0x00000008  // Capture Mode
#define QEI_CTL_SIGMODE                0x00000004  // Signal Mode
#define QEI_CTL_SWAP                   0x00000002  // Swap Signals
#define QEI_CTL_ENABLE                 0x00000001  // Enable QEI
                                       
#define QEI_STAT_DIRECTION             0x00000002  // Direction of Rotation
#define QEI_STAT_ERROR                 0x00000001  // Error Detected
                                       
#define QEI_POS_M                      0xFFFFFFFF  // Current Position Integrator Value
#define QEI_POS_S                      0
                                       
#define QEI_MAXPOS_M                   0xFFFFFFFF  // Maximum Position Integrator Value
#define QEI_MAXPOS_S                   0
                                       
#define QEI_LOAD_M                     0xFFFFFFFF  // Velocity Timer Load Value
#define QEI_LOAD_S                     0
                                       
#define QEI_TIME_M                     0xFFFFFFFF  // Velocity Timer Current Value
#define QEI_TIME_S                     0

#define QEI_COUNT_M                    0xFFFFFFFF  // Velocity Pulse Count
#define QEI_COUNT_S                    0
                                       
#define QEI_SPEED_M                    0xFFFFFFFF  // Velocity
#define QEI_SPEED_S                    0
                                       
#define QEI_INTEN_ERROR                0x00000008  // Phase Error Interrupt Enable
#define QEI_INTEN_DIR                  0x00000004  // Direction Change Interrupt Enable
#define QEI_INTEN_TIMER                0x00000002  // Timer Expires Interrupt Enable
#define QEI_INTEN_INDEX                0x00000001  // Index Pulse Detected Interrupt Enable
                                       
#define QEI_RIS_ERROR                  0x00000008  // Phase Error Detected
#define QEI_RIS_DIR                    0x00000004  // Direction Change Detected
#define QEI_RIS_TIMER                  0x00000002  // Velocity Timer Expired
#define QEI_RIS_INDEX                  0x00000001  // Index Pulse Asserted
                                       
#define QEI_ISC_ERROR                  0x00000008  // Phase Error Interrupt
#define QEI_ISC_DIR                    0x00000004  // Direction Change Interrupt
#define QEI_ISC_TIMER                  0x00000002  // Velocity Timer Expired Interrupt
#define QEI_ISC_INDEX                  0x00000001  // Index Pulse Interrupt
                                 
//**************************************************************************************************
// TIMER                         
//**************************************************************************************************
#define TIMER_CFG_M                    0x00000007  // GPTM Configuration
#define TIMER_CFG_32_BIT_TIMER         0x00000000  // 32-bit timer configuration
#define TIMER_CFG_32_BIT_RTC           0x00000001  // 32-bit real-time clock (RTC) counter configuration
#define TIMER_CFG_16_BIT               0x00000004  // 16-bit timer configuration. The function is controlled by bits 1:0 of GPTMTAMR and GPTMTBMR
                                       
#define TIMER_TAMR_TAAMS               0x00000008  // GPTM Timer A Alternate Mode Select
#define TIMER_TAMR_TACMR               0x00000004  // GPTM Timer A Capture Mode
#define TIMER_TAMR_TAMR_M              0x00000003  // GPTM Timer A Mode
#define TIMER_TAMR_TAMR_1_SHOT         0x00000001  // One-Shot Timer mode
#define TIMER_TAMR_TAMR_PERIOD         0x00000002  // Periodic Timer mode
#define TIMER_TAMR_TAMR_CAP            0x00000003  // Capture mode

#define TIMER_TBMR_TBAMS               0x00000008  // GPTM Timer B Alternate Mode Select
#define TIMER_TBMR_TBCMR               0x00000004  // GPTM Timer B Capture Mode
#define TIMER_TBMR_TBMR_M              0x00000003  // GPTM Timer B Mode
#define TIMER_TBMR_TBMR_1_SHOT         0x00000001  // One-Shot Timer mode
#define TIMER_TBMR_TBMR_PERIOD         0x00000002  // Periodic Timer mode
#define TIMER_TBMR_TBMR_CAP            0x00000003  // Capture mode
                                       
