lightelf76/FNET/fnet_stack/port/cpu/lm3s/lm3s_bits.h
#define TIMER_CTL_TBPWML               0x00004000  // GPTM Timer B PWM Output Level
#define TIMER_CTL_TBOTE                0x00002000  // GPTM Timer B Output Trigger Enable
#define TIMER_CTL_TBEVENT_M            0x00000C00  // GPTM Timer B Event Mode
#define TIMER_CTL_TBEVENT_POS          0x00000000  // Positive edge
#define TIMER_CTL_TBEVENT_NEG          0x00000400  // Negative edge
#define TIMER_CTL_TBEVENT_BOTH         0x00000C00  // Both edges
#define TIMER_CTL_TBSTALL              0x00000200  // GPTM Timer B Stall Enable
#define TIMER_CTL_TBEN                 0x00000100  // GPTM Timer B Enable
#define TIMER_CTL_TAPWML               0x00000040  // GPTM Timer A PWM Output Level
#define TIMER_CTL_TAOTE                0x00000020  // GPTM Timer A Output Trigger Enable
#define TIMER_CTL_RTCEN                0x00000010  // GPTM RTC Enable
#define TIMER_CTL_TAEVENT_M            0x0000000C  // GPTM Timer A Event Mode
#define TIMER_CTL_TAEVENT_POS          0x00000000  // Positive edge
#define TIMER_CTL_TAEVENT_NEG          0x00000004  // Negative edge
#define TIMER_CTL_TAEVENT_BOTH         0x0000000C  // Both edges
#define TIMER_CTL_TASTALL              0x00000002  // GPTM Timer A Stall Enable
#define TIMER_CTL_TAEN                 0x00000001  // GPTM Timer A Enable
                                       
#define TIMER_IMR_CBEIM                0x00000400  // GPTM Capture B Event Interrupt Mask
#define TIMER_IMR_CBMIM                0x00000200  // GPTM Capture B Match Interrupt Mask
#define TIMER_IMR_TBTOIM               0x00000100  // GPTM Timer B Time-Out Interrupt Mask
#define TIMER_IMR_RTCIM                0x00000008  // GPTM RTC Interrupt Mask
#define TIMER_IMR_CAEIM                0x00000004  // GPTM Capture A Event Interrupt Mask
#define TIMER_IMR_CAMIM                0x00000002  // GPTM Capture A Match Interrupt Mask
#define TIMER_IMR_TATOIM               0x00000001  // GPTM Timer A Time-Out Interrupt Mask
                                       
#define TIMER_RIS_CBERIS               0x00000400  // GPTM Capture B Event Raw Interrupt
#define TIMER_RIS_CBMRIS               0x00000200  // GPTM Capture B Match Raw Interrupt
#define TIMER_RIS_TBTORIS              0x00000100  // GPTM Timer B Time-Out Raw Interrupt
#define TIMER_RIS_RTCRIS               0x00000008  // GPTM RTC Raw Interrupt
#define TIMER_RIS_CAERIS               0x00000004  // GPTM Capture A Event Raw Interrupt
#define TIMER_RIS_CAMRIS               0x00000002  // GPTM Capture A Match Raw Interrupt
#define TIMER_RIS_TATORIS              0x00000001  // GPTM Timer A Time-Out Raw Interrupt
                                       
#define TIMER_MIS_CBEMIS               0x00000400  // GPTM Capture B Event Masked Interrupt
#define TIMER_MIS_CBMMIS               0x00000200  // GPTM Capture B Match Masked Interrupt
#define TIMER_MIS_TBTOMIS              0x00000100  // GPTM Timer B Time-Out Masked Interrupt
#define TIMER_MIS_RTCMIS               0x00000008  // GPTM RTC Masked Interrupt
#define TIMER_MIS_CAEMIS               0x00000004  // GPTM Capture A Event Masked Interrupt
#define TIMER_MIS_CAMMIS               0x00000002  // GPTM Capture A Match Masked Interrupt
#define TIMER_MIS_TATOMIS              0x00000001  // GPTM Timer A Time-Out Masked Interrupt
                                       
#define TIMER_ICR_CBECINT              0x00000400  // GPTM Capture B Event Interrupt Clear
#define TIMER_ICR_CBMCINT              0x00000200  // GPTM Capture B Match Interrupt Clear
#define TIMER_ICR_TBTOCINT             0x00000100  // GPTM Timer B Time-Out Interrupt Clear
#define TIMER_ICR_RTCCINT              0x00000008  // GPTM RTC Interrupt Clear
#define TIMER_ICR_CAECINT              0x00000004  // GPTM Capture A Event Interrupt Clear
#define TIMER_ICR_CAMCINT              0x00000002  // GPTM Capture A Match Interrupt Clear
#define TIMER_ICR_TATOCINT             0x00000001  // GPTM Timer A Time-Out Raw Interrupt

#define TIMER_TAILR_TAILRH_M           0xFFFF0000  // GPTM Timer A Interval Load Register High
#define TIMER_TAILR_TAILRL_M           0x0000FFFF  // GPTM Timer A Interval Load Register Low
#define TIMER_TAILR_TAILRH_S           16
#define TIMER_TAILR_TAILRL_S           0
                                       
#define TIMER_TBILR_TBILRL_M           0x0000FFFF  // GPTM Timer B Interval Load Register
#define TIMER_TBILR_TBILRL_S           0
                                       
#define TIMER_TAMATCHR_TAMRH_M         0xFFFF0000  // GPTM Timer A Match Register High
#define TIMER_TAMATCHR_TAMRL_M         0x0000FFFF  // GPTM Timer A Match Register Low
#define TIMER_TAMATCHR_TAMRH_S         16
#define TIMER_TAMATCHR_TAMRL_S         0
                                       
#define TIMER_TBMATCHR_TBMRL_M         0x0000FFFF  // GPTM Timer B Match Register Low
#define TIMER_TBMATCHR_TBMRL_S         0
                                       
#define TIMER_TAPR_TAPSR_M             0x000000FF  // GPTM Timer A Prescale
#define TIMER_TAPR_TAPSR_S             0
                                       
#define TIMER_TBPR_TBPSR_M             0x000000FF  // GPTM Timer B Prescale
#define TIMER_TBPR_TBPSR_S             0
                                       
#define TIMER_TAPMR_TAPSMR_M           0x000000FF  // GPTM TimerA Prescale Match
#define TIMER_TAPMR_TAPSMR_S           0
                                       
#define TIMER_TBPMR_TBPSMR_M           0x000000FF  // GPTM TimerB Prescale Match
#define TIMER_TBPMR_TBPSMR_S           0
                                       
#define TIMER_TAR_TARH_M               0xFFFF0000  // GPTM Timer A Register High
#define TIMER_TAR_TARL_M               0x0000FFFF  // GPTM Timer A Register Low
#define TIMER_TAR_TARH_S               16
#define TIMER_TAR_TARL_S               0
                                       
#define TIMER_TBR_TBRL_M               0x0000FFFF  // GPTM Timer B
#define TIMER_TBR_TBRL_S               0

//**************************************************************************************************
// ADC
//**************************************************************************************************
#define ADC_ACTSS_ASEN3                0x00000008  // ADC SS3 Enable
#define ADC_ACTSS_ASEN2                0x00000004  // ADC SS2 Enable
#define ADC_ACTSS_ASEN1                0x00000002  // ADC SS1 Enable
#define ADC_ACTSS_ASEN0                0x00000001  // ADC SS0 Enable
                                       
#define ADC_RIS_INR3                   0x00000008  // SS3 Raw Interrupt Status
#define ADC_RIS_INR2                   0x00000004  // SS2 Raw Interrupt Status
#define ADC_RIS_INR1                   0x00000002  // SS1 Raw Interrupt Status
#define ADC_RIS_INR0                   0x00000001  // SS0 Raw Interrupt Status

#define ADC_IM_MASK3                   0x00000008  // SS3 Interrupt Mask
#define ADC_IM_MASK2                   0x00000004  // SS2 Interrupt Mask
#define ADC_IM_MASK1                   0x00000002  // SS1 Interrupt Mask
#define ADC_IM_MASK0                   0x00000001  // SS0 Interrupt Mask
                                       
#define ADC_ISC_IN3                    0x00000008  // SS3 Interrupt Status and Clear
#define ADC_ISC_IN2                    0x00000004  // SS2 Interrupt Status and Clear
#define ADC_ISC_IN1                    0x00000002  // SS1 Interrupt Status and Clear
#define ADC_ISC_IN0                    0x00000001  // SS0 Interrupt Status and Clear

#define ADC_OSTAT_OV3                  0x00000008  // SS3 FIFO Overflow
#define ADC_OSTAT_OV2                  0x00000004  // SS2 FIFO Overflow
#define ADC_OSTAT_OV1                  0x00000002  // SS1 FIFO Overflow
#define ADC_OSTAT_OV0                  0x00000001  // SS0 FIFO Overflow
                                       
