lightelf76/FNET/fnet_stack/port/cpu/lm3s/lm3s_bits.h
#define ADC_SSMUX1_MUX3_M              0x00003000  // 4th Sample Input Select
#define ADC_SSMUX1_MUX2_M              0x00000300  // 3rd Sample Input Select
#define ADC_SSMUX1_MUX1_M              0x00000030  // 2nd Sample Input Select
#define ADC_SSMUX1_MUX0_M              0x00000003  // 1st Sample Input Select
#define ADC_SSMUX1_MUX3_S              12
#define ADC_SSMUX1_MUX2_S              8
#define ADC_SSMUX1_MUX1_S              4
#define ADC_SSMUX1_MUX0_S              0
                                       
#define ADC_SSCTL1_TS3                 0x00008000  // 4th Sample Temp Sensor Select
#define ADC_SSCTL1_IE3                 0x00004000  // 4th Sample Interrupt Enable
#define ADC_SSCTL1_END3                0x00002000  // 4th Sample is End of Sequence
#define ADC_SSCTL1_D3                  0x00001000  // 4th Sample Diff Input Select
#define ADC_SSCTL1_TS2                 0x00000800  // 3rd Sample Temp Sensor Select
#define ADC_SSCTL1_IE2                 0x00000400  // 3rd Sample Interrupt Enable
#define ADC_SSCTL1_END2                0x00000200  // 3rd Sample is End of Sequence
#define ADC_SSCTL1_D2                  0x00000100  // 3rd Sample Diff Input Select
#define ADC_SSCTL1_TS1                 0x00000080  // 2nd Sample Temp Sensor Select
#define ADC_SSCTL1_IE1                 0x00000040  // 2nd Sample Interrupt Enable
#define ADC_SSCTL1_END1                0x00000020  // 2nd Sample is End of Sequence
#define ADC_SSCTL1_D1                  0x00000010  // 2nd Sample Diff Input Select
#define ADC_SSCTL1_TS0                 0x00000008  // 1st Sample Temp Sensor Select
#define ADC_SSCTL1_IE0                 0x00000004  // 1st Sample Interrupt Enable
#define ADC_SSCTL1_END0                0x00000002  // 1st Sample is End of Sequence
#define ADC_SSCTL1_D0                  0x00000001  // 1st Sample Diff Input Select
                                       
#define ADC_SSFIFO1_DATA_M             0x000003FF  // Conversion Result Data
#define ADC_SSFIFO1_DATA_S             0
                                       
#define ADC_SSFSTAT1_FULL              0x00001000  // FIFO Full
#define ADC_SSFSTAT1_EMPTY             0x00000100  // FIFO Empty
#define ADC_SSFSTAT1_HPTR_M            0x000000F0  // FIFO Head Pointer
#define ADC_SSFSTAT1_TPTR_M            0x0000000F  // FIFO Tail Pointer
#define ADC_SSFSTAT1_HPTR_S            4
#define ADC_SSFSTAT1_TPTR_S            0
                                       
#define ADC_SSMUX2_MUX3_M              0x00003000  // 4th Sample Input Select
#define ADC_SSMUX2_MUX2_M              0x00000300  // 3rd Sample Input Select
#define ADC_SSMUX2_MUX1_M              0x00000030  // 2nd Sample Input Select
#define ADC_SSMUX2_MUX0_M              0x00000003  // 1st Sample Input Select
#define ADC_SSMUX2_MUX3_S              12
#define ADC_SSMUX2_MUX2_S              8
#define ADC_SSMUX2_MUX1_S              4
#define ADC_SSMUX2_MUX0_S              0
                                       
#define ADC_SSCTL2_TS3                 0x00008000  // 4th Sample Temp Sensor Select
#define ADC_SSCTL2_IE3                 0x00004000  // 4th Sample Interrupt Enable
#define ADC_SSCTL2_END3                0x00002000  // 4th Sample is End of Sequence
#define ADC_SSCTL2_D3                  0x00001000  // 4th Sample Diff Input Select
#define ADC_SSCTL2_TS2                 0x00000800  // 3rd Sample Temp Sensor Select
#define ADC_SSCTL2_IE2                 0x00000400  // 3rd Sample Interrupt Enable
#define ADC_SSCTL2_END2                0x00000200  // 3rd Sample is End of Sequence
#define ADC_SSCTL2_D2                  0x00000100  // 3rd Sample Diff Input Select
#define ADC_SSCTL2_TS1                 0x00000080  // 2nd Sample Temp Sensor Select
#define ADC_SSCTL2_IE1                 0x00000040  // 2nd Sample Interrupt Enable
#define ADC_SSCTL2_END1                0x00000020  // 2nd Sample is End of Sequence
#define ADC_SSCTL2_D1                  0x00000010  // 2nd Sample Diff Input Select
#define ADC_SSCTL2_TS0                 0x00000008  // 1st Sample Temp Sensor Select
#define ADC_SSCTL2_IE0                 0x00000004  // 1st Sample Interrupt Enable
#define ADC_SSCTL2_END0                0x00000002  // 1st Sample is End of Sequence
#define ADC_SSCTL2_D0                  0x00000001  // 1st Sample Diff Input Select
                                       
#define ADC_SSFIFO2_DATA_M             0x000003FF  // Conversion Result Data
#define ADC_SSFIFO2_DATA_S             0
                                       
#define ADC_SSFSTAT2_FULL              0x00001000  // FIFO Full
#define ADC_SSFSTAT2_EMPTY             0x00000100  // FIFO Empty
#define ADC_SSFSTAT2_HPTR_M            0x000000F0  // FIFO Head Pointer
#define ADC_SSFSTAT2_TPTR_M            0x0000000F  // FIFO Tail Pointer
#define ADC_SSFSTAT2_HPTR_S            4
#define ADC_SSFSTAT2_TPTR_S            0
                                       
#define ADC_SSMUX3_MUX0_M              0x00000003  // 1st Sample Input Select
#define ADC_SSMUX3_MUX0_S              0

#define ADC_SSCTL3_TS0                 0x00000008  // 1st Sample Temp Sensor Select
#define ADC_SSCTL3_IE0                 0x00000004  // 1st Sample Interrupt Enable
#define ADC_SSCTL3_END0                0x00000002  // 1st Sample is End of Sequence
#define ADC_SSCTL3_D0                  0x00000001  // 1st Sample Diff Input Select
                                       
#define ADC_SSFIFO3_DATA_M             0x000003FF  // Conversion Result Data
#define ADC_SSFIFO3_DATA_S             0
                                       
#define ADC_SSFSTAT3_FULL              0x00001000  // FIFO Full
#define ADC_SSFSTAT3_EMPTY             0x00000100  // FIFO Empty
#define ADC_SSFSTAT3_HPTR_M            0x000000F0  // FIFO Head Pointer
#define ADC_SSFSTAT3_TPTR_M            0x0000000F  // FIFO Tail Pointer
#define ADC_SSFSTAT3_HPTR_S            4
#define ADC_SSFSTAT3_TPTR_S            0
                                       
#define ADC_TMLB_LB                    0x00000001  // Loopback Mode Enable
                                       
