lightelf76/FNET/fnet_stack/port/cpu/lm3s/lm3s_bits.h
#define ADC_SSFIFO_TMLB_CNT_M          0x000003C0  // Continuous Sample Counter
#define ADC_SSFIFO_TMLB_CONT           0x00000020  // Continuation Sample Indicator
#define ADC_SSFIFO_TMLB_DIFF           0x00000010  // Differential Sample Indicator
#define ADC_SSFIFO_TMLB_TS             0x00000008  // Temp Sensor Sample Indicator
#define ADC_SSFIFO_TMLB_MUX_M          0x00000007  // Analog Input Indicator
#define ADC_SSFIFO_TMLB_CNT_S          6           // Sample counter shift
#define ADC_SSFIFO_TMLB_MUX_S          0           // Input channel number shift

//**************************************************************************************************
// COMP
//**************************************************************************************************
#define COMP_ACMIS_IN1                 0x00000002  // Comparator 1 Masked Interrupt Status
#define COMP_ACMIS_IN0                 0x00000001  // Comparator 0 Masked Interrupt Status
                                       
#define COMP_ACRIS_IN1                 0x00000002  // Comparator 1 Interrupt Status
#define COMP_ACRIS_IN0                 0x00000001  // Comparator 0 Interrupt Status
                                       
#define COMP_ACINTEN_IN1               0x00000002  // Comparator 1 Interrupt Enable
#define COMP_ACINTEN_IN0               0x00000001  // Comparator 0 Interrupt Enable
                                       
#define COMP_ACREFCTL_EN               0x00000200  // Resistor Ladder Enable
#define COMP_ACREFCTL_RNG              0x00000100  // Resistor Ladder Range
#define COMP_ACREFCTL_VREF_M           0x0000000F  // Resistor Ladder Voltage Ref
#define COMP_ACREFCTL_VREF_S           0
                                       
#define COMP_ACSTAT0_OVAL              0x00000002  // Comparator Output Value
                                       
#define COMP_ACCTL0_TOEN               0x00000800  // Trigger Output Enable
#define COMP_ACCTL0_ASRCP_M            0x00000600  // Analog Source Positive
#define COMP_ACCTL0_ASRCP_PIN          0x00000000  // Pin value of Cn+
#define COMP_ACCTL0_ASRCP_PIN0         0x00000200  // Pin value of C0+
#define COMP_ACCTL0_ASRCP_REF          0x00000400  // Internal voltage reference (VIREF)
#define COMP_ACCTL0_TSLVAL             0x00000080  // Trigger Sense Level Value
#define COMP_ACCTL0_TSEN_M             0x00000060  // Trigger Sense
#define COMP_ACCTL0_TSEN_LEVEL         0x00000000  // Level sense, see TSLVAL
#define COMP_ACCTL0_TSEN_FALL          0x00000020  // Falling edge
#define COMP_ACCTL0_TSEN_RISE          0x00000040  // Rising edge
#define COMP_ACCTL0_TSEN_BOTH          0x00000060  // Either edge
#define COMP_ACCTL0_ISLVAL             0x00000010  // Interrupt Sense Level Value
#define COMP_ACCTL0_ISEN_M             0x0000000C  // Interrupt Sense
#define COMP_ACCTL0_ISEN_LEVEL         0x00000000  // Level sense, see ISLVAL
#define COMP_ACCTL0_ISEN_FALL          0x00000004  // Falling edge
#define COMP_ACCTL0_ISEN_RISE          0x00000008  // Rising edge
#define COMP_ACCTL0_ISEN_BOTH          0x0000000C  // Either edge
#define COMP_ACCTL0_CINV               0x00000002  // Comparator Output Invert

#define COMP_ACSTAT1_OVAL              0x00000002  // Comparator Output Value
                                       
#define COMP_ACCTL1_TOEN               0x00000800  // Trigger Output Enable
#define COMP_ACCTL1_ASRCP_M            0x00000600  // Analog Source Positive
#define COMP_ACCTL1_ASRCP_PIN          0x00000000  // Pin value of Cn+
#define COMP_ACCTL1_ASRCP_PIN0         0x00000200  // Pin value of C0+
#define COMP_ACCTL1_ASRCP_REF          0x00000400  // Internal voltage reference (VIREF)
#define COMP_ACCTL1_TSLVAL             0x00000080  // Trigger Sense Level Value
#define COMP_ACCTL1_TSEN_M             0x00000060  // Trigger Sense
#define COMP_ACCTL1_TSEN_LEVEL         0x00000000  // Level sense, see TSLVAL
#define COMP_ACCTL1_TSEN_FALL          0x00000020  // Falling edge
#define COMP_ACCTL1_TSEN_RISE          0x00000040  // Rising edge
#define COMP_ACCTL1_TSEN_BOTH          0x00000060  // Either edge
#define COMP_ACCTL1_ISLVAL             0x00000010  // Interrupt Sense Level Value
#define COMP_ACCTL1_ISEN_M             0x0000000C  // Interrupt Sense
#define COMP_ACCTL1_ISEN_LEVEL         0x00000000  // Level sense, see ISLVAL
#define COMP_ACCTL1_ISEN_FALL          0x00000004  // Falling edge
#define COMP_ACCTL1_ISEN_RISE          0x00000008  // Rising edge
#define COMP_ACCTL1_ISEN_BOTH          0x0000000C  // Either edge
#define COMP_ACCTL1_CINV               0x00000002  // Comparator Output Invert

//**************************************************************************************************
// ETHERNET MAC
//**************************************************************************************************
#define MAC_RIS_PHYINT                 0x00000040  // PHY Interrupt
#define MAC_RIS_MDINT                  0x00000020  // MII Transaction Complete
#define MAC_RIS_RXER                   0x00000010  // Receive Error
#define MAC_RIS_FOV                    0x00000008  // FIFO Overrun
#define MAC_RIS_TXEMP                  0x00000004  // Transmit FIFO Empty
#define MAC_RIS_TXER                   0x00000002  // Transmit Error
#define MAC_RIS_RXINT                  0x00000001  // Packet Received

#define MAC_IACK_PHYINT                0x00000040  // Clear PHY Interrupt
#define MAC_IACK_MDINT                 0x00000020  // Clear MII Transaction Complete
#define MAC_IACK_RXER                  0x00000010  // Clear Receive Error
#define MAC_IACK_FOV                   0x00000008  // Clear FIFO Overrun
#define MAC_IACK_TXEMP                 0x00000004  // Clear Transmit FIFO Empty
#define MAC_IACK_TXER                  0x00000002  // Clear Transmit Error
#define MAC_IACK_RXINT                 0x00000001  // Clear Packet Received

#define MAC_IM_PHYINTM                 0x00000040  // Mask PHY Interrupt
#define MAC_IM_MDINTM                  0x00000020  // Mask MII Transaction Complete
#define MAC_IM_RXERM                   0x00000010  // Mask Receive Error
#define MAC_IM_FOVM                    0x00000008  // Mask FIFO Overrun
#define MAC_IM_TXEMPM                  0x00000004  // Mask Transmit FIFO Empty
#define MAC_IM_TXERM                   0x00000002  // Mask Transmit Error
#define MAC_IM_RXINTM                  0x00000001  // Mask Packet Received

#define MAC_RCTL_RSTFIFO               0x00000010  // Clear Receive FIFO
#define MAC_RCTL_BADCRC                0x00000008  // Enable Reject Bad CRC
#define MAC_RCTL_PRMS                  0x00000004  // Enable Promiscuous Mode
#define MAC_RCTL_AMUL                  0x00000002  // Enable Multicast Frames
#define MAC_RCTL_RXEN                  0x00000001  // Enable Receiver
                                       
#define MAC_TCTL_DUPLEX                0x00000010  // Enable Duplex Mode
#define MAC_TCTL_CRC                   0x00000004  // Enable CRC Generation
#define MAC_TCTL_PADEN                 0x00000002  // Enable Packet Padding
#define MAC_TCTL_TXEN                  0x00000001  // Enable Transmitter
                                       
