lightelf76/FNET/fnet_stack/port/cpu/lm3s/lm3s_bits.h
#define MAC_DATA_TXDATA_M              0xFFFFFFFF  // Transmit FIFO Data
#define MAC_DATA_RXDATA_M              0xFFFFFFFF  // Receive FIFO Data
#define MAC_DATA_RXDATA_S              0
#define MAC_DATA_TXDATA_S              0

#define MAC_IA0_MACOCT4_M              0xFF000000  // MAC Address Octet 4
#define MAC_IA0_MACOCT3_M              0x00FF0000  // MAC Address Octet 3
#define MAC_IA0_MACOCT2_M              0x0000FF00  // MAC Address Octet 2
#define MAC_IA0_MACOCT1_M              0x000000FF  // MAC Address Octet 1
#define MAC_IA0_MACOCT4_S              24
#define MAC_IA0_MACOCT3_S              16
#define MAC_IA0_MACOCT2_S              8
#define MAC_IA0_MACOCT1_S              0

#define MAC_IA1_MACOCT6_M              0x0000FF00  // MAC Address Octet 6
#define MAC_IA1_MACOCT5_M              0x000000FF  // MAC Address Octet 5
#define MAC_IA1_MACOCT6_S              8
#define MAC_IA1_MACOCT5_S              0
                                       
#define MAC_THR_THRESH_M               0x0000003F  // Threshold Value
#define MAC_THR_THRESH_S               0

#define MAC_MCTL_REGADR_M              0x000000F8  // MII Register Address
#define MAC_MCTL_WRITE                 0x00000002  // MII Register Transaction Type
#define MAC_MCTL_START                 0x00000001  // MII Register Transaction Enable
#define MAC_MCTL_REGADR_S              3
                                       
#define MAC_MDV_DIV_M                  0x000000FF  // Clock Divider
#define MAC_MDV_DIV_S                  0

#define MAC_MTXD_MDTX_M                0x0000FFFF  // MII Register Transmit Data
#define MAC_MTXD_MDTX_S                0
                                       
#define MAC_MRXD_MDRX_M                0x0000FFFF  // MII Register Receive Data
#define MAC_MRXD_MDRX_S                0
                                       
#define MAC_NP_NPR_M                   0x0000003F  // Number of Packets in Receive FIFO
#define MAC_NP_NPR_S                   0

#define MAC_TR_NEWTX                   0x00000001  // New Transmission
                                       
#define MAC_LED_LED1_M                 0x00000F00  // LED1 Source
#define MAC_LED_LED1_LINK              0x00000000  // Link OK
#define MAC_LED_LED1_RXTX              0x00000100  // RX or TX Activity (Default LED1)
#define MAC_LED_LED1_100               0x00000500  // 100BASE-TX mode
#define MAC_LED_LED1_10                0x00000600  // 10BASE-T mode
#define MAC_LED_LED1_DUPLEX            0x00000700  // Full-Duplex
#define MAC_LED_LED1_LINKACT           0x00000800  // Link OK & Blink=RX or TX
                                                   // Activity
#define MAC_LED_LED0_M                 0x0000000F  // LED0 Source
#define MAC_LED_LED0_LINK              0x00000000  // Link OK (Default LED0)
#define MAC_LED_LED0_RXTX              0x00000001  // RX or TX Activity
#define MAC_LED_LED0_100               0x00000005  // 100BASE-TX mode
#define MAC_LED_LED0_10                0x00000006  // 10BASE-T mode
#define MAC_LED_LED0_DUPLEX            0x00000007  // Full-Duplex
#define MAC_LED_LED0_LINKACT           0x00000008  // Link OK & Blink=RX or TX

#define MAC_MDIX_EN                    0x00000001  // MDI/MDI-X Enable

//**************************************************************************************************
// ETHERNET PHY
//**************************************************************************************************
#define PHY_MR0                        0x00000000  // Ethernet PHY Management Register 0  - Control
#define PHY_MR1                        0x00000001  // Ethernet PHY Management Register 1  - Status
#define PHY_MR2                        0x00000002  // Ethernet PHY Management Register 2  - PHY Identifier 1
#define PHY_MR3                        0x00000003  // Ethernet PHY Management Register 3  - PHY Identifier 2
#define PHY_MR4                        0x00000004  // Ethernet PHY Management Register 4  - Auto-Negotiation Advertisement
#define PHY_MR5                        0x00000005  // Ethernet PHY Management Register 5  - Auto-Negotiation Link Partner Base Page Ability
#define PHY_MR6                        0x00000006  // Ethernet PHY Management Register 6  - Auto-Negotiation Expansion
#define PHY_MR16                       0x00000010  // Ethernet PHY Management Register 16 - Vendor-Specific
#define PHY_MR17                       0x00000011  // Ethernet PHY Management Register 17 - Mode Control/Status
#define PHY_MR18                       0x00000012  // Ethernet PHY Management Register 18 - Diagnostic
#define PHY_MR19                       0x00000013  // Ethernet PHY Management Register 19 - Transceiver Control
#define PHY_MR23                       0x00000017  // Ethernet PHY Management Register 23 - LED Configuration
#define PHY_MR24                       0x00000018  // Ethernet PHY Management Register 24 - MDI/MDIX Control

#define PHY_MR0_RESET                  0x00008000  // Reset Registers
#define PHY_MR0_LOOPBK                 0x00004000  // Loopback Mode
#define PHY_MR0_SPEEDSL                0x00002000  // Speed Select
#define PHY_MR0_ANEGEN                 0x00001000  // Auto-Negotiation Enable
#define PHY_MR0_PWRDN                  0x00000800  // Power Down
#define PHY_MR0_ISO                    0x00000400  // Isolate
#define PHY_MR0_RANEG                  0x00000200  // Restart Auto-Negotiation
#define PHY_MR0_DUPLEX                 0x00000100  // Set Duplex Mode
#define PHY_MR0_COLT                   0x00000080  // Collision Test
                                       
#define PHY_MR1_100X_F                 0x00004000  // 100BASE-TX Full-Duplex Mode
#define PHY_MR1_100X_H                 0x00002000  // 100BASE-TX Half-Duplex Mode
#define PHY_MR1_10T_F                  0x00001000  // 10BASE-T Full-Duplex Mode
#define PHY_MR1_10T_H                  0x00000800  // 10BASE-T Half-Duplex Mode
#define PHY_MR1_MFPS                   0x00000040  // Management Frames with Preamble Suppressed
#define PHY_MR1_ANEGC                  0x00000020  // Auto-Negotiation Complete
#define PHY_MR1_RFAULT                 0x00000010  // Remote Fault
#define PHY_MR1_ANEGA                  0x00000008  // Auto-Negotiation
#define PHY_MR1_LINK                   0x00000004  // Link Made
#define PHY_MR1_JAB                    0x00000002  // Jabber Condition
#define PHY_MR1_EXTD                   0x00000001  // Extended Capabilities
                                       
