lightelf76/FNET/fnet_stack/port/cpu/lm3s/lm3s_bits.h
#define PHY_MR2_OUI_M                  0x0000FFFF  // Organizationally Unique Identifier[21:6]
#define PHY_MR2_OUI_S                  0
                                       
#define PHY_MR3_OUI_M                  0x0000FC00  // Organizationally Unique Identifier[5:0]
#define PHY_MR3_MN_M                   0x000003F0  // Model Number
#define PHY_MR3_RN_M                   0x0000000F  // Revision Number
#define PHY_MR3_OUI_S                  10
#define PHY_MR3_MN_S                   4
#define PHY_MR3_RN_S                   0
                                       
#define PHY_MR4_NP                     0x00008000  // Next Page
#define PHY_MR4_RF                     0x00002000  // Remote Fault
#define PHY_MR4_A3                     0x00000100  // Technology Ability Field [3]
#define PHY_MR4_A2                     0x00000080  // Technology Ability Field [2]
#define PHY_MR4_A1                     0x00000040  // Technology Ability Field [1]
#define PHY_MR4_A0                     0x00000020  // Technology Ability Field [0]
#define PHY_MR4_S_M                    0x0000001F  // Selector Field
#define PHY_MR4_S_S                    0

#define PHY_MR5_NP                     0x00008000  // Next Page
#define PHY_MR5_ACK                    0x00004000  // Acknowledge
#define PHY_MR5_RF                     0x00002000  // Remote Fault
#define PHY_MR5_A_M                    0x00001FE0  // Technology Ability Field
#define PHY_MR5_S_M                    0x0000001F  // Selector Field
#define PHY_MR5_S_8023                 0x00000001  // IEEE Std 802.3
#define PHY_MR5_S_8029                 0x00000002  // IEEE Std 802.9 ISLAN-16T
#define PHY_MR5_S_8025                 0x00000003  // IEEE Std 802.5
#define PHY_MR5_S_1394                 0x00000004  // IEEE Std 1394
#define PHY_MR5_A_S                    5
                                       
#define PHY_MR6_PDF                    0x00000010  // Parallel Detection Fault
#define PHY_MR6_LPNPA                  0x00000008  // Link Partner is Next Page Able
#define PHY_MR6_PRX                    0x00000002  // New Page Received
#define PHY_MR6_LPANEGA                0x00000001  // Link Partner is Auto-Negotiation Able
                                       
#define PHY_MR16_RPTR                  0x00008000  // Repeater Mode
#define PHY_MR16_INPOL                 0x00004000  // Interrupt Polarity
#define PHY_MR16_TXHIM                 0x00001000  // Transmit High Impedance Mode
#define PHY_MR16_SQEI                  0x00000800  // SQE Inhibit Testing
#define PHY_MR16_NL10                  0x00000400  // Natural Loopback Mode
#define PHY_MR16_APOL                  0x00000020  // Auto-Polarity Disable
#define PHY_MR16_RVSPOL                0x00000010  // Receive Data Polarity
#define PHY_MR16_PCSBP                 0x00000002  // PCS Bypass
#define PHY_MR16_RXCC                  0x00000001  // Receive Clock Control
                                       
#define PHY_MR17_JABBER_IE             0x00008000  // Jabber Interrupt Enable
#define PHY_MR17_RXER_IE               0x00004000  // Receive Error Interrupt Enable
#define PHY_MR17_PRX_IE                0x00002000  // Page Received Interrupt Enable
#define PHY_MR17_PDF_IE                0x00001000  // Parallel Detection Fault Interrupt Enable
#define PHY_MR17_LPACK_IE              0x00000800  // LP Acknowledge Interrupt Enable
#define PHY_MR17_LSCHG_IE              0x00000400  // Link Status Change Interrupt Enable
#define PHY_MR17_RFAULT_IE             0x00000200  // Remote Fault Interrupt Enable
#define PHY_MR17_ANEGCOMP_IE           0x00000100  // Auto-Negotiation Complete Interrupt Enable
#define PHY_MR17_JABBER_INT            0x00000080  // Jabber Event Interrupt
#define PHY_MR17_RXER_INT              0x00000040  // Receive Error Interrupt
#define PHY_MR17_PRX_INT               0x00000020  // Page Receive Interrupt
#define PHY_MR17_PDF_INT               0x00000010  // Parallel Detection Fault Interrupt
#define PHY_MR17_LPACK_INT             0x00000008  // LP Acknowledge Interrupt
#define PHY_MR17_LSCHG_INT             0x00000004  // Link Status Change Interrupt
#define PHY_MR17_RFAULT_INT            0x00000002  // Remote Fault Interrupt
#define PHY_MR17_ANEGCOMP_INT          0x00000001  // Auto-Negotiation Complete Interrupt
                                       
#define PHY_MR18_ANEGF                 0x00001000  // Auto-Negotiation Failure
#define PHY_MR18_DPLX                  0x00000800  // Duplex Mode
#define PHY_MR18_RATE                  0x00000400  // Rate
#define PHY_MR18_RXSD                  0x00000200  // Receive Detection
#define PHY_MR18_RX_LOCK               0x00000100  // Receive PLL Lock
                                       
#define PHY_MR19_TXO_M                 0x0000C000  // Transmit Amplitude Selection
#define PHY_MR19_TXO_00DB              0x00000000  // Gain set for 0.0dB of insertion loss
#define PHY_MR19_TXO_04DB              0x00004000  // Gain set for 0.4dB of insertion loss
#define PHY_MR19_TXO_08DB              0x00008000  // Gain set for 0.8dB of insertion loss
#define PHY_MR19_TXO_12DB              0x0000C000  // Gain set for 1.2dB of insertion loss
                                       
#define PHY_MR23_LED1_M                0x000000F0  // LED1 Source
#define PHY_MR23_LED1_LINK             0x00000000  // Link OK
#define PHY_MR23_LED1_RXTX             0x00000010  // RX or TX Activity (Default LED1)
#define PHY_MR23_LED1_100              0x00000050  // 100BASE-TX mode
#define PHY_MR23_LED1_10               0x00000060  // 10BASE-T mode
#define PHY_MR23_LED1_DUPLEX           0x00000070  // Full-Duplex
#define PHY_MR23_LED1_LINKACT          0x00000080  // Link OK & Blink=RX or TX Activity
#define PHY_MR23_LED0_M                0x0000000F  // LED0 Source
#define PHY_MR23_LED0_LINK             0x00000000  // Link OK (Default LED0)
#define PHY_MR23_LED0_RXTX             0x00000001  // RX or TX Activity
#define PHY_MR23_LED0_100              0x00000005  // 100BASE-TX mode
#define PHY_MR23_LED0_10               0x00000006  // 10BASE-T mode
#define PHY_MR23_LED0_DUPLEX           0x00000007  // Full-Duplex
#define PHY_MR23_LED0_LINKACT          0x00000008  // Link OK & Blink=RX or TX Activity
                                       
#define PHY_MR24_PD_MODE               0x00000080  // Parallel Detection Mode
#define PHY_MR24_AUTO_SW               0x00000040  // Auto-Switching Enable
#define PHY_MR24_MDIX                  0x00000020  // Auto-Switching Configuration
#define PHY_MR24_MDIX_CM               0x00000010  // Auto-Switching Complete
#define PHY_MR24_MDIX_SD_M             0x0000000F  // Auto-Switching Seed
#define PHY_MR24_MDIX_SD_S             0
                                       
//**************************************************************************************************
// HIBERNATION
//**************************************************************************************************
#define HIB_RTCC_M                     0xFFFFFFFF  // RTC Counter
#define HIB_RTCC_S                     0
                                       
#define HIB_RTCM0_M                    0xFFFFFFFF  // RTC Match 0
#define HIB_RTCM0_S                    0
                                       
#define HIB_RTCM1_M                    0xFFFFFFFF  // RTC Match 1
#define HIB_RTCM1_S                    0
                                       
#define HIB_RTCLD_M                    0xFFFFFFFF  // RTC Load
#define HIB_RTCLD_S                    0
                                       
#define HIB_CTL_VABORT                 0x00000080  // Power Cut Abort Enable
#define HIB_CTL_CLK32EN                0x00000040  // Clocking Enable
#define HIB_CTL_LOWBATEN               0x00000020  // Low Battery Monitoring Enable
#define HIB_CTL_PINWEN                 0x00000010  // External WAKE Pin Enable
#define HIB_CTL_RTCWEN                 0x00000008  // RTC Wake-up Enable
#define HIB_CTL_CLKSEL                 0x00000004  // Hibernation Module Clock Select
#define HIB_CTL_HIBREQ                 0x00000002  // Hibernation Request
#define HIB_CTL_RTCEN                  0x00000001  // RTC Timer Enable
                                       
#define HIB_IM_EXTW                    0x00000008  // External Wake-Up Interrupt Mask
#define HIB_IM_LOWBAT                  0x00000004  // Low Battery Voltage Interrupt Mask
#define HIB_IM_RTCALT1                 0x00000002  // RTC Alert 1 Interrupt Mask
#define HIB_IM_RTCALT0                 0x00000001  // RTC Alert 0 Interrupt Mask
                                       
