lightelf76/FNET/fnet_stack/port/cpu/lm3s/lm3s_bits.h
#define HIB_RIS_EXTW                   0x00000008  // External Wake-Up Raw Interrupt Status
#define HIB_RIS_LOWBAT                 0x00000004  // Low Battery Voltage Raw Interrupt Status
#define HIB_RIS_RTCALT1                0x00000002  // RTC Alert 1 Raw Interrupt Status
#define HIB_RIS_RTCALT0                0x00000001  // RTC Alert 0 Raw Interrupt Status
                                       
#define HIB_MIS_EXTW                   0x00000008  // External Wake-Up Masked Interrupt Status
#define HIB_MIS_LOWBAT                 0x00000004  // Low Battery Voltage Masked Interrupt Status
#define HIB_MIS_RTCALT1                0x00000002  // RTC Alert 1 Masked Interrupt Status
#define HIB_MIS_RTCALT0                0x00000001  // RTC Alert 0 Masked Interrupt Status
                                       
#define HIB_IC_EXTW                    0x00000008  // External Wake-Up Masked Interrupt Clear
#define HIB_IC_LOWBAT                  0x00000004  // Low Battery Voltage Masked Interrupt Clear
#define HIB_IC_RTCALT1                 0x00000002  // RTC Alert1 Masked Interrupt Clear
#define HIB_IC_RTCALT0                 0x00000001  // RTC Alert0 Masked Interrupt Clear
                                       
#define HIB_RTCT_TRIM_M                0x0000FFFF  // RTC Trim Value
#define HIB_RTCT_TRIM_S                0
                                       
#define HIB_DATA_RTD_M                 0xFFFFFFFF  // Hibernation Module NV Data
#define HIB_DATA_RTD_S                 0

//**************************************************************************************************
// FLASH
//**************************************************************************************************
#define FLASH_FMA_OFFSET_M             0x0003FFFF  // Address Offset
#define FLASH_FMA_OFFSET_S             0
                                       
#define FLASH_FMD_DATA_M               0xFFFFFFFF  // Data Value
#define FLASH_FMD_DATA_S               0
                                       
#define FLASH_FMC_WRKEY                0xA4420000  // FLASH write key
#define FLASH_FMC_COMT                 0x00000008  // Commit Register Value
#define FLASH_FMC_MERASE               0x00000004  // Mass Erase Flash Memory
#define FLASH_FMC_ERASE                0x00000002  // Erase a Page of Flash Memory
#define FLASH_FMC_WRITE                0x00000001  // Write a Word into Flash Memory
                                       
#define FLASH_FCRIS_PRIS               0x00000002  // Programming Raw Interrupt Status
#define FLASH_FCRIS_ARIS               0x00000001  // Access Raw Interrupt Status
                                       
#define FLASH_FCIM_PMASK               0x00000002  // Programming Interrupt Mask
#define FLASH_FCIM_AMASK               0x00000001  // Access Interrupt Mask
                                       
#define FLASH_FCMISC_PMISC             0x00000002  // Programming Masked Interrupt Status and Clear
#define FLASH_FCMISC_AMISC             0x00000001  // Access Masked Interrupt Status and Clear
                                       
#define FLASH_USECRL_M                 0x000000FF  // Microsecond Reload Value
#define FLASH_USECRL_S                 0

#define FLASH_USERDBG_NW               0x80000000  // User Debug Not Written
#define FLASH_USERDBG_DATA_M           0x7FFFFFFC  // User Data
#define FLASH_USERDBG_DBG1             0x00000002  // Debug Control 1
#define FLASH_USERDBG_DBG0             0x00000001  // Debug Control 0
#define FLASH_USERDBG_DATA_S           2
                                       
#define FLASH_USERREG0_NW              0x80000000  // Not Written
#define FLASH_USERREG0_DATA_M          0x7FFFFFFF  // User Data
#define FLASH_USERREG0_DATA_S          0

#define FLASH_USERREG1_NW              0x80000000  // Not Written
#define FLASH_USERREG1_DATA_M          0x7FFFFFFF  // User Data
#define FLASH_USERREG1_DATA_S          0
                                       
#define FLASH_PROTECT_SIZE             0x00000800
#define FLASH_ERASE_SIZE               0x00000400


#define SCB_CPUID_REVISION             ((uint32_t)0x0000000F)        /*!< Implementation defined revision number */
#define SCB_CPUID_PARTNO               ((uint32_t)0x0000FFF0)        /*!< Number of processor within family */
#define SCB_CPUID_Constant             ((uint32_t)0x000F0000)        /*!< Reads as 0x0F */
#define SCB_CPUID_VARIANT              ((uint32_t)0x00F00000)        /*!< Implementation defined variant number */
#define SCB_CPUID_IMPLEMENTER          ((uint32_t)0xFF000000)        /*!< Implementer code. ARM is 0x41 */

/*******************  Bit definition for SCB_ICSR register  *******************/
#define SCB_ICSR_VECTACTIVE            ((uint32_t)0x000001FF)        /*!< Active ISR number field */
#define SCB_ICSR_RETTOBASE             ((uint32_t)0x00000800)        /*!< All active exceptions minus the IPSR_current_exception yields the empty set */
#define SCB_ICSR_VECTPENDING           ((uint32_t)0x003FF000)        /*!< Pending ISR number field */
#define SCB_ICSR_ISRPENDING            ((uint32_t)0x00400000)        /*!< Interrupt pending flag */
#define SCB_ICSR_ISRPREEMPT            ((uint32_t)0x00800000)        /*!< It indicates that a pending interrupt becomes active in the next running cycle */
#define SCB_ICSR_PENDSTCLR             ((uint32_t)0x02000000)        /*!< Clear pending SysTick bit */
#define SCB_ICSR_PENDSTSET             ((uint32_t)0x04000000)        /*!< Set pending SysTick bit */
#define SCB_ICSR_PENDSVCLR             ((uint32_t)0x08000000)        /*!< Clear pending pendSV bit */
#define SCB_ICSR_PENDSVSET             ((uint32_t)0x10000000)        /*!< Set pending pendSV bit */
#define SCB_ICSR_NMIPENDSET            ((uint32_t)0x80000000)        /*!< Set pending NMI bit */

/*******************  Bit definition for SCB_VTOR register  *******************/
#define SCB_VTOR_TBLOFF                ((uint32_t)0x1FFFFF80)        /*!< Vector table base offset field */
#define SCB_VTOR_TBLBASE               ((uint32_t)0x20000000)        /*!< Table base in code(0) or RAM(1) */

/*!<*****************  Bit definition for SCB_AIRCR register  *******************/
#define SCB_AIRCR_VECTRESET            ((uint32_t)0x00000001)        /*!< System Reset bit */
#define SCB_AIRCR_VECTCLRACTIVE        ((uint32_t)0x00000002)        /*!< Clear active vector bit */
#define SCB_AIRCR_SYSRESETREQ          ((uint32_t)0x00000004)        /*!< Requests chip control logic to generate a reset */

