lightelf76/FNET/fnet_stack/port/cpu/lm3s/lm3s_bits.h
#define SCB_AIRCR_PRIGROUP             ((uint32_t)0x00000700)        /*!< PRIGROUP[2:0] bits (Priority group) */
#define SCB_AIRCR_PRIGROUP_0           ((uint32_t)0x00000100)        /*!< Bit 0 */
#define SCB_AIRCR_PRIGROUP_1           ((uint32_t)0x00000200)        /*!< Bit 1 */
#define SCB_AIRCR_PRIGROUP_2           ((uint32_t)0x00000400)        /*!< Bit 2  */

/* prority group configuration */
#define SCB_AIRCR_PRIGROUP0            ((uint32_t)0x00000000)        /*!< Priority group=0 (7 bits of pre-emption priority, 1 bit of subpriority) */
#define SCB_AIRCR_PRIGROUP1            ((uint32_t)0x00000100)        /*!< Priority group=1 (6 bits of pre-emption priority, 2 bits of subpriority) */
#define SCB_AIRCR_PRIGROUP2            ((uint32_t)0x00000200)        /*!< Priority group=2 (5 bits of pre-emption priority, 3 bits of subpriority) */
#define SCB_AIRCR_PRIGROUP3            ((uint32_t)0x00000300)        /*!< Priority group=3 (4 bits of pre-emption priority, 4 bits of subpriority) */
#define SCB_AIRCR_PRIGROUP4            ((uint32_t)0x00000400)        /*!< Priority group=4 (3 bits of pre-emption priority, 5 bits of subpriority) */
#define SCB_AIRCR_PRIGROUP5            ((uint32_t)0x00000500)        /*!< Priority group=5 (2 bits of pre-emption priority, 6 bits of subpriority) */
#define SCB_AIRCR_PRIGROUP6            ((uint32_t)0x00000600)        /*!< Priority group=6 (1 bit of pre-emption priority, 7 bits of subpriority) */
#define SCB_AIRCR_PRIGROUP7            ((uint32_t)0x00000700)        /*!< Priority group=7 (no pre-emption priority, 8 bits of subpriority) */

#define SCB_AIRCR_ENDIANESS            ((uint32_t)0x00008000)        /*!< Data endianness bit */
#define SCB_AIRCR_VECTKEY              ((uint32_t)0xFFFF0000)        /*!< Register key (VECTKEY) - Reads as 0xFA05 (VECTKEYSTAT) */

/*******************  Bit definition for SCB_SCR register  ********************/
#define SCB_SCR_SLEEPONEXIT            ((uint8_t)0x02)               /*!< Sleep on exit bit */
#define SCB_SCR_SLEEPDEEP              ((uint8_t)0x04)               /*!< Sleep deep bit */
#define SCB_SCR_SEVONPEND              ((uint8_t)0x10)               /*!< Wake up from WFE */

/********************  Bit definition for SCB_CCR register  *******************/
#define SCB_CCR_NONBASETHRDENA         ((uint16_t)0x0001)            /*!< Thread mode can be entered from any level in Handler mode by controlled return value */
#define SCB_CCR_USERSETMPEND           ((uint16_t)0x0002)            /*!< Enables user code to write the Software Trigger Interrupt register to trigger (pend) a Main exception */
#define SCB_CCR_UNALIGN_TRP            ((uint16_t)0x0008)            /*!< Trap for unaligned access */
#define SCB_CCR_DIV_0_TRP              ((uint16_t)0x0010)            /*!< Trap on Divide by 0 */
#define SCB_CCR_BFHFNMIGN              ((uint16_t)0x0100)            /*!< Handlers running at priority -1 and -2 */
#define SCB_CCR_STKALIGN               ((uint16_t)0x0200)            /*!< On exception entry, the SP used prior to the exception is adjusted to be 8-byte aligned */

/*******************  Bit definition for SCB_SHPR register ********************/
#define SCB_SHPR_PRI_N                 ((uint32_t)0x000000FF)        /*!< Priority of system handler 4,8, and 12. Mem Manage, reserved and Debug Monitor */
#define SCB_SHPR_PRI_N1                ((uint32_t)0x0000FF00)        /*!< Priority of system handler 5,9, and 13. Bus Fault, reserved and reserved */
#define SCB_SHPR_PRI_N2                ((uint32_t)0x00FF0000)        /*!< Priority of system handler 6,10, and 14. Usage Fault, reserved and PendSV */
#define SCB_SHPR_PRI_N3                ((uint32_t)0xFF000000)        /*!< Priority of system handler 7,11, and 15. Reserved, SVCall and SysTick */

/******************  Bit definition for SCB_SHCSR register  *******************/
#define SCB_SHCSR_MEMFAULTACT          ((uint32_t)0x00000001)        /*!< MemManage is active */
#define SCB_SHCSR_BUSFAULTACT          ((uint32_t)0x00000002)        /*!< BusFault is active */
#define SCB_SHCSR_USGFAULTACT          ((uint32_t)0x00000008)        /*!< UsageFault is active */
#define SCB_SHCSR_SVCALLACT            ((uint32_t)0x00000080)        /*!< SVCall is active */
#define SCB_SHCSR_MONITORACT           ((uint32_t)0x00000100)        /*!< Monitor is active */
#define SCB_SHCSR_PENDSVACT            ((uint32_t)0x00000400)        /*!< PendSV is active */
#define SCB_SHCSR_SYSTICKACT           ((uint32_t)0x00000800)        /*!< SysTick is active */
#define SCB_SHCSR_USGFAULTPENDED       ((uint32_t)0x00001000)        /*!< Usage Fault is pended */
#define SCB_SHCSR_MEMFAULTPENDED       ((uint32_t)0x00002000)        /*!< MemManage is pended */
#define SCB_SHCSR_BUSFAULTPENDED       ((uint32_t)0x00004000)        /*!< Bus Fault is pended */
#define SCB_SHCSR_SVCALLPENDED         ((uint32_t)0x00008000)        /*!< SVCall is pended */
#define SCB_SHCSR_MEMFAULTENA          ((uint32_t)0x00010000)        /*!< MemManage enable */
#define SCB_SHCSR_BUSFAULTENA          ((uint32_t)0x00020000)        /*!< Bus Fault enable */
#define SCB_SHCSR_USGFAULTENA          ((uint32_t)0x00040000)        /*!< UsageFault enable */

/*******************  Bit definition for SCB_CFSR register  *******************/
/*!< MFSR */
#define SCB_CFSR_IACCVIOL              ((uint32_t)0x00000001)        /*!< Instruction access violation */
#define SCB_CFSR_DACCVIOL              ((uint32_t)0x00000002)        /*!< Data access violation */
#define SCB_CFSR_MUNSTKERR             ((uint32_t)0x00000008)        /*!< Unstacking error */
#define SCB_CFSR_MSTKERR               ((uint32_t)0x00000010)        /*!< Stacking error */
#define SCB_CFSR_MMARVALID             ((uint32_t)0x00000080)        /*!< Memory Manage Address Register address valid flag */
/*!< BFSR */
#define SCB_CFSR_IBUSERR               ((uint32_t)0x00000100)        /*!< Instruction bus error flag */
#define SCB_CFSR_PRECISERR             ((uint32_t)0x00000200)        /*!< Precise data bus error */
#define SCB_CFSR_IMPRECISERR           ((uint32_t)0x00000400)        /*!< Imprecise data bus error */
#define SCB_CFSR_UNSTKERR              ((uint32_t)0x00000800)        /*!< Unstacking error */
#define SCB_CFSR_STKERR                ((uint32_t)0x00001000)        /*!< Stacking error */
#define SCB_CFSR_BFARVALID             ((uint32_t)0x00008000)        /*!< Bus Fault Address Register address valid flag */
/*!< UFSR */
#define SCB_CFSR_UNDEFINSTR            ((uint32_t)0x00010000)        /*!< The processor attempt to execute an undefined instruction */
#define SCB_CFSR_INVSTATE              ((uint32_t)0x00020000)        /*!< Invalid combination of EPSR and instruction */
#define SCB_CFSR_INVPC                 ((uint32_t)0x00040000)        /*!< Attempt to load EXC_RETURN into pc illegally */
#define SCB_CFSR_NOCP                  ((uint32_t)0x00080000)        /*!< Attempt to use a coprocessor instruction */
#define SCB_CFSR_UNALIGNED             ((uint32_t)0x01000000)        /*!< Fault occurs when there is an attempt to make an unaligned memory access */
#define SCB_CFSR_DIVBYZERO             ((uint32_t)0x02000000)        /*!< Fault occurs when SDIV or DIV instruction is used with a divisor of 0 */

/*******************  Bit definition for SCB_HFSR register  *******************/
#define SCB_HFSR_VECTTBL               ((uint32_t)0x00000002)        /*!< Fault occurs because of vector table read on exception processing */
#define SCB_HFSR_FORCED                ((uint32_t)0x40000000)        /*!< Hard Fault activated when a configurable Fault was received and cannot activate */
#define SCB_HFSR_DEBUGEVT              ((uint32_t)0x80000000)        /*!< Fault related to debug */

/*******************  Bit definition for SCB_DFSR register  *******************/
#define SCB_DFSR_HALTED                ((uint8_t)0x01)               /*!< Halt request flag */
#define SCB_DFSR_BKPT                  ((uint8_t)0x02)               /*!< BKPT flag */
#define SCB_DFSR_DWTTRAP               ((uint8_t)0x04)               /*!< Data Watchpoint and Trace (DWT) flag */
#define SCB_DFSR_VCATCH                ((uint8_t)0x08)               /*!< Vector catch flag */
#define SCB_DFSR_EXTERNAL              ((uint8_t)0x10)               /*!< External debug request flag */

/*******************  Bit definition for SCB_MMFAR register  ******************/
#define SCB_MMFAR_ADDRESS              ((uint32_t)0xFFFFFFFF)        /*!< Mem Manage fault address field */

/*******************  Bit definition for SCB_BFAR register  *******************/
#define SCB_BFAR_ADDRESS               ((uint32_t)0xFFFFFFFF)        /*!< Bus fault address field */

/*******************  Bit definition for SCB_afsr register  *******************/
#define SCB_AFSR_IMPDEF                ((uint32_t)0xFFFFFFFF)        /*!< Implementation defined */

#endif /* __H_BITS_LM3S__ */